{
    "Samiran": {
        "name": "Samiran",
        "rating": null,
        "address": "G8C6+5QF, Industrial Area, Durgapur, West Bengal 713210",
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": null,
        "reviews": ""
    },
    "Zakir Hosen Rubel- Pharmacist,RMP,Surveyor,Freelancer": {
        "name": "Zakir Hosen Rubel- Pharmacist,RMP,Surveyor,Freelancer",
        "rating": "5.0(2)",
        "address": "ward no-09, Badshah Bari, Barishal, Industrial Area, Durgapur, West Bengal 713210",
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": "facebook.com",
        "hours": "Sunday, Open 24 hours; Monday, Open 24 hours; Tuesday, Open 24 hours; Wednesday, Open 24 hours; Thursday, Open 24 hours; Friday, Open 24 hours; Saturday, Open 24 hours. Hide open hours for the week",
        "reviews": ""
    },
    "Birendranath Dalui": {
        "name": "Birendranath Dalui",
        "rating": "5.0(1)",
        "address": "Industrial Area, Durgapur, West Bengal 713210",
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Sunday, Closed; Monday, Closed; Tuesday, 12:09 am to 2:10 pm; Wednesday, Closed; Thursday, Closed; Friday, Closed; Saturday, Closed. Hide open hours for the week",
        "reviews": ""
    },
    "Dr(Prof) Pramod Singh": {
        "name": "Dr(Prof) Pramod Singh",
        "rating": "5.0",
        "address": "Bengal Ambuja Housing Complex, City Center, Durgapur, West Bengal 713216",
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Sunday, Closed; Monday, 6 to 7 pm; Tuesday, 6 to 7 pm; Wednesday, 6 to 7 pm; Thursday, 6 to 7 pm; Friday, 6 to 7 pm; Saturday, 6:30 to 7:30 am. Hide open hours for the week",
        "reviews": "Great laparoscopic and general surgeon of Durgapur West Bengal.\nExperience more than 23 years.\nVery good behaviour; Experience Laparoscopic surgeon and Urologist more than 22yrs.\nVery humble and kind behaviour.\nExperience teacher also.; A very good orator and a great doctor also he is equivalent to God among us.❤️👍 …; A very good lecturer and a great Sergent♥️; Best Laparoscopic Surgeon in Durgapur; Great lecturer and great surgeon 💝 …; A good lecturer and a great Sergent ...💕 …; Best teacher and a surgeon; Excellent Dr."
    },
    "Dr Rehman clinic cum home": {
        "name": "Dr Rehman clinic cum home",
        "rating": "4.3",
        "address": "G8Q2+C87, Sambhu Mitra Path, Doctor's Colony, City Center, Durgapur, West Bengal 713216",
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Sunday, Open 24 hours; Monday, Open 24 hours; Tuesday, Open 24 hours; Wednesday, Open 24 hours; Thursday, Open 24 hours; Friday, Open 24 hours; Saturday, Open 24 hours. Hide open hours for the week",
        "reviews": "Visit in early morning around8-8.30. Good soctor; The Best doctor for childs in Durgapur surrounding; One of the best child specialist in town. Polite, listen to the problem carefully and explain everything.; Best dr in durgapur; Super Doctor"
    },
    "Dr Debajyoti Roy": {
        "name": "Dr Debajyoti Roy",
        "rating": "4.9",
        "address": "A-9, Abanindra Bithi, Non-Company Housing Estate, City Center, Durgapur, West Bengal 713216",
        "phone": "094341 01368",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": null,
        "reviews": "Had a good experience visiting Dr. Debajyoti Roy Sir.Dr.Roy is highly experienced  and knowledgeable and listens very calmly. I recently visited Dr. Roy for my son ear problem. He carefully examined and prescribed medicine. Now my son is fine. Thank you Dr. Roy.; A great doctor, with a great personality who lives in the moment and respects time. He treated my grandmother in such a way that they seemed to be familiar, which made her comfortable. As soon as I enter to his clinic he doesn't seemed a …; High experienced Dr, problem was detected at the very first moment. Chamber is very neat and clean with Modern equipments. Patients feel comfortable because of his nice and friendly  behaviour.; Dr. Debajyoti Roy is an excellent ENT Consultant in Durgapur. His behaviour and honesty is so remarkable. I visited to him so many times regarding my ear problem and from his consultation and diagnosis too much helpful everytime to cure my …; I visited Dr. Debajyoti Roy sir a few years ago for a particular ear problem and there was huge pain inside my ear and nobody could be able to treat my pain as he treated and it took only one day to heal my ear and I was so happy as well as …; Had a good experience visiting Dr. Debajyoti Roy Sir. My issues were checked and addressed properly. Definitely recommend everyone to visit him. He's very experienced in his field. I wish my issues solve properly. 🙏 JAY SREE RAM 🙏 …"
    },
    "Dr Manoj Singh, Chamber , Pharmacy And Patho Lab": {
        "name": "Dr Manoj Singh, Chamber , Pharmacy And Patho Lab",
        "rating": "4.4",
        "address": "Vasundhara 5/7, City Center, Sukumar Roy Path, City Center, Durgapur, West Bengal 713216",
        "phone": "098322 67550",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": null,
        "reviews": "Very experienced doctor within 2 mins he diagnosed my problem and prescribed me some medicine and feeling better....very good doctor and not today types wherein the first thing doctor asks to do is Blood test unnecessarily; This man doesn’t listen to patients at all. When I started explaining my problems in detail he immediately told me to tell him just the summary in a rude way. If a doctor doesn’t have the patience to listen to patients issue properly then how will the doctor diagnose properly?; Wrost doctor ever i hav seen in my life. Looted my 520 rupees within 2 minutes , treated 2.5mtr distance away from me , he hv no sense how to treat a patient even not interested to listen my problems , just filling blank prescription and given non brand medicine in print rate ..; Best dr In durgapur; Dr. Chamber is very spacious and very neat and clean, parking space available too. Consultation and medicine with Discount available ..; Some time good behaviour always not ...; Most friendly atmosphere at chamber.Very understanding Doctor.; Very Good doctor and very good diagnosis.; One of the very best physician..."
    },
    "Dr B B Senapati": {
        "name": "Dr B B Senapati",
        "rating": "4.0",
        "address": "G982+6M7, Sahid Sukumar Banerjee Sarani, Bidhannagar, Durgapur, West Bengal 713212",
        "phone": "0343 253 5656",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Sunday, Closed; Monday, 10 am to 3 pm; Tuesday, 10 am to 3 pm; Wednesday, 10 am to 3 pm; Thursday, 10 am to 3 pm; Friday, 10 am to 3 pm; Saturday, 10 am to 3 pm. Hide open hours for the week",
        "reviews": "This is recidence of Dr. B B Senapati. The phone number provided doesn't get attended. Please reach out to Wellness Dental Clinic near Pubali, Durgapur; Dr. B.B Senapati is an excellent doctor. He truly is a gentleman. He has a great degree of patience to listen to every patient's problems and this is something which helps him in a patient's treatment process. My parents used to take me to him for treatments when I was a child and still now after almost 32 years we visit him.; The phone number does not work. This is disgusting because my grandmother is 92 yrs old and she can't risk travel to your home unless an appointment has been booked. Moreover, we don't stay in Durgapur. Just to find out if your clinic is …; Doctor's address is changed . He is now available at wellness health centre near to kanhaiya sweets. Fees is rs 600; Dr. senapati Renwond Medicine doctor in Durgapur City. He is very nice doctor.; Very good doctor in durgapur; Not attend this phone number; He is a great doctor"
    },
    "Dr. Kumar's Clinic": {
        "name": "Dr. Kumar's Clinic",
        "rating": "4.9",
        "address": "Abanindra Bithi, Doctor's Colony, City Center, Durgapur, West Bengal 713216",
        "phone": "081168 97296",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": "drkumarsclinicdgp.com",
        "hours": "Sunday, 8 am to 6 pm; Monday, 8 am to 8 pm; Tuesday, 8 am to 8 pm; Wednesday, 8 am to 8 pm; Thursday, 8 am to 8 pm; Friday, 8 am to 8 pm; Saturday, 8 am to 8 pm. Hide open hours for the week",
        "reviews": "In  the City of Durgapur one of the Best Clinic Dr. Kumar's Clinic.My experience was amazing, Dr. Rakesh Kumar is a fantastic person and a great doctor with sweet behavior . He is explaining each and Everything to his patients clearly. I would strongly  recommend to Dr. Kumar.; It was an amazing experience for me. Dr. Kumar is very well skilled and a very kind hearted person I have ever met. He always provides support to his patients with utmost care. Highly recommended from my side 😌👍👍 …; As I am closely related to Diabetes & complications by profession, one thing I must say that this clinic & it's owner Dr. Rakesh Kumar is one of it's kind. One can find many clinics at range of Durgapur & surrounding areas, but what sets …; I generally don't love giving feedback but today I couldn't stop myself as it would help many and bcz this is something health related. Such a personalized service, here they listen you with utmost sincerity and above all one can't get such …; My experience was amazing. Dr. Kumar is a fantastic person and a great doctor. He is explaining each and Everything to his patients clearly. I had no reluctance to ask for what I needed. I would recommend Dr. Kumar.; One of the Best Doctor in Durgapur for Diabetes and it's implications. Excellent diagnosis and very polite. State of the art equipments and the location is in the heart of City centre Durgapur.; Nice place with good environment.\nI appreciate Dr Rakesh Kumar experience and dedication towards his work. His primary objobjectives are to educate people on the management of diabetes and it's complications.."
    },
    "Dr. S Sengupta": {
        "name": "Dr. S Sengupta",
        "rating": "4.5",
        "address": "G89P+5FV, Bidhannagar, Durgapur, West Bengal 713212",
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": null,
        "reviews": "Very Experienced Doctor"
    },
    "Dr Mahadeb Mondal's Clinic": {
        "name": "Dr Mahadeb Mondal's Clinic",
        "rating": "5.0",
        "address": "G7QM+464, Industrial Area, Durgapur, West Bengal 713213",
        "phone": "096358 61506",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Sunday, Open 24 hours; Monday, Open 24 hours; Tuesday, Open 24 hours; Wednesday, Open 24 hours; Thursday, Open 24 hours; Friday, Open 24 hours; Saturday, Open 24 hours. Hide open hours for the week",
        "reviews": "Excellence Diaganosis"
    },
    "Doctor Indranil Mukherjee ENT Surgeon/ MAYA ENT & HEAD NECK CENTRE/ Best ENT Clinic in Durgapur": {
        "name": "Doctor Indranil Mukherjee ENT Surgeon/ MAYA ENT & HEAD NECK CENTRE/ Best ENT Clinic in Durgapur",
        "rating": "4.9",
        "address": "A, 31, Abanindra Bithi, near Chaturanga Ground, Non-Company Housing Estate, City Center, Durgapur, West Bengal 713216",
        "phone": "090466 24433",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": "mayaentclinic.com",
        "hours": "Sunday, 9 to 11:30 am; Monday, 5 to 9 pm; Tuesday, 5 to 9 pm; Wednesday, 5 to 9 pm; Thursday, 5 to 9 pm; Friday, Closed; Saturday, 5 to 9 pm. Hide open hours for the week",
        "reviews": "I had some problems related to my ears and i took an appointment there.\nI'm very satisfied with the diagnosis and I felt that Dr. Indranil Mukherjee is indeed a kind hearted person, and will listen to your problems with patience. …; I have got an pleasant experience through out my Treatment. A well equipped clinic with Best Doctor. I recommend to all for visit to this Clinic with your problem .This clinic also provide Sleep Management with proper Guidance.\nThanks to Dr. INDRANIL MUKHERJEE.; I recently visited Dr. Indranil Mukherjee, an ENT specialist, and I couldn't be more impressed. His expertise and professionalism were evident from the moment I walked in. Dr. Mukherjee took the time to listen to my concerns and thoroughly …; Very well intellectual interaction with doctor.. he explains everything and greets patient with smile.... overall great treatment; I got operated for tonsillectomy by Dr.Indranil, had a speedy recovery and always got support and complete knowledge throughout the operation by the doctor. All in one word very good doctor with expertise in his field.; Best ent surgen in durgapur City. Thankyou so much sir for your treatment. Now I am well and very good. My endoscopy surgery done by doctor indranil sir thank you once again sir. I am share my feedback after recovery thankyou sir 🙏 …; \"Maya ENT clinic\" is one of the best and well established ENT clinic in Durgapur.  Dr. Indranil Mukherjee sir is very polite, down to Earth and very experienced ENT doctor. If  there is any kind of  ear, nose and throat related problem you can visit here without any doubt."
    },
    "Dr. Banerjee": {
        "name": "Dr. Banerjee",
        "rating": "5.0",
        "address": "H-57, ISPAT PALLI, Bidhannagar, Durgapur, West Bengal 713212",
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": null,
        "reviews": "Good gyno ki doctor. h"
    },
    "Dr Partha Pratim Mukherjee": {
        "name": "Dr Partha Pratim Mukherjee",
        "rating": "5.0",
        "address": "G8Q2+M79, Non-Company Housing Estate, City Center, Durgapur, West Bengal 713216",
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": null,
        "reviews": "GOOD CITY . ALL ARE AVAILABLE HERE. MAXIMUM PEOPLE ARE EDUCATED & CREATIVE.  I LOVE MY CITY.\nTHANKS."
    },
    "Ashok kumbhakar": {
        "name": "Ashok kumbhakar",
        "rating": "3.9",
        "address": "2, Satyen Bose Sarani, Michael Sarani, Benachity, Durgapur, West Bengal 713213",
        "phone": "094130 14382",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": null,
        "reviews": "One of the staffs is very rude. behaves like school principal, u cannot see ur phone, even if its not crowded child cannot sit on chairs , fathers cannot be there... Very rude behaviour. He is little aged ... The other staff is okay. Doctor is good.; Very rude and unprofessional behaviour by staff. Always shouting and misbehaving. Also chamber does not maintain covid protocols and very unhygenic. The attendant staff himself was not wearing mask. Not recommended at all.; Booking staff very rude...May be as directed by doctor.\nI asked him that it's an urgent case.He refused to book my case and said can't book today. …; Most inhuman doctor. Behaviour of the doctor & booking staff are very rude.\nNo help provide during emergency.; Experienced doctor...well diagnosis... chamber always remains crowded.; Doctor is good but behaviour is very rude; God in human form..\nA Salute for his excellency; Very Experienced and Good Child Specialist."
    },
    "IQ City Clinic": {
        "name": "IQ City Clinic",
        "rating": "3.8",
        "address": "G8Q4+7VJ, Bengal Ambuja Housing Complex, Ambuja, Durgapur, West Bengal 713216",
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Sunday, 9 am to 9 pm; Monday, 9 am to 9 pm; Tuesday, 9 am to 9 pm; Wednesday, 9 am to 9 pm; Thursday, 9 am to 9 pm; Friday, 9 am to 9 pm; Saturday, 9 am to 9 pm. Hide open hours for the week",
        "reviews": "Excellent Hospital, doctor nurse and all staf is very good 😊. Ulto palta taka nayna... …; Free of cost medical check-up by qualified doctors and free medicine is availavle to the patients too that are prescribed by the doctor. …; Excellent place for quality treatment; Worst place to admit a patient. Administration vishon baje. Patient k sobsomoy costliest bed e admit koranor chesta hoy, proyojon na thakleo. Ekta Ultrasonography report dite at least 4-5 din somoy lagay, jate patient aro kichhu din admitted thake. Ekhane patient k rakha mane patient ke ekrokom torture kora. Wo"
    },
    "Dr B.Roy": {
        "name": "Dr B.Roy",
        "rating": "4.4",
        "address": "Bengal Ambuja Housing Complex, Ambuja, Durgapur, West Bengal 713216",
        "phone": "094342 24319",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Sunday, 9 am to 1 pm, 5 to 8 pm; Monday, 9 am to 1 pm, 5 to 7:30 pm; Tuesday, 9 am to 1 pm, 5 to 8 pm; Wednesday, Closed; Thursday, 9 am to 1 pm, 5 to 8 pm; Friday, 9 am to 1 pm, 5 to 8 pm; Saturday, 9 am to 1 pm, 5 to 8 pm. Hide open hours for the week",
        "reviews": "Money receipt dosent contain any receipt number and also no signature. Is this an ethical practice???; I was suffering from my throat problem and after visiting Doc it was cured atlast very much thankful to you Dr B.Roy; Great dr; Better experience; Great doctor...; Best doctor...; Experienced doctor.; Great doctor"
    },
    "Healthworld Hospitals": {
        "name": "Healthworld Hospitals",
        "rating": "3.8",
        "address": "C-49, Commercial Area, Opp ESIC Sub-regional Office City Centre, Gandhi More, Commercial Area, Durgapur, West Bengal 713216",
        "phone": "081700 55555",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": "healthworldhospitals.com",
        "hours": "Sunday, Open 24 hours; Monday, Open 24 hours; Tuesday, Open 24 hours; Wednesday, Open 24 hours; Thursday, Open 24 hours; Friday, Open 24 hours; Saturday, Open 24 hours. Hide open hours for the week",
        "reviews": "Healthworld hospital doesn't deserve any star. Horrific experience...terrific experience...worst nursing behavior...they misbehave with patient...A doctor Mr. Suman Saha was playing video games and operating share market chart at the time …; The worst hospital in all of Durgapur. I would never recommend this dreadful hospital to anyone. They have brutally murdered my mother-in-law. They don't have any proper infrastructure, and the doctors are worthless. Her body C-reactive …; One of the best experiences that I had personally when my mother in law survived a stroke . Dr Sunil Kumar has been empathatic and gave us the right treatment; Hospital doctor staff nothing good at all, hospital runs by nurses, onec u admit here u can't find any goodness .you may see some good reviews but believe me these are fake. My father had admitted here for a orthopaedic surgery. After …; It's name should be changed not health world...\"LOOT WORLD\"\n\nfor basic ear lobe surgery to repair under local anastasia .. Dr Kaushik paul …"
    },
    "Dr Lal PathLabs - Patient Service Centre": {
        "name": "Dr Lal PathLabs - Patient Service Centre",
        "rating": "2.8",
        "address": "near Big Bazar, Doctors Colony, City Center, Durgapur, West Bengal 713216",
        "phone": "080 6256 4420",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": "labs.lalpathlabs.com",
        "hours": "Sunday, 8 am to 2 pm; Monday, 7:30 am to 7:30 pm; Tuesday, 7:30 am to 7:30 pm; Wednesday, 7:30 am to 7:30 pm; Thursday, 7:30 am to 7:30 pm; Friday, 7:30 am to 7:30 pm; Saturday, 7:30 am to 7:30 pm. Hide open hours for the week",
        "reviews": "Horrible people, they mix up samples and provide false report, then behave rudely on confronting them. I had to take test from another center and confirm that these people produced incorrect report.; Third class service.. charging Rs.500/- sample collection charges without any bill.; I want to give this lab 00 rating, this guys are rude, not helpful.; Service vary bad"
    },
    "Dr. SANKAR MANNA ( Homoeopathic Doctor)": {
        "name": "Dr. SANKAR MANNA ( Homoeopathic Doctor)",
        "rating": "5.0",
        "address": "Unnamed Road, Industrial Area, Durgapur, NetajiColony, West Bengal 713201",
        "phone": "098322 46595",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": "sankarmanna2832.wixsite.com",
        "hours": "Sunday, 10 am to 12:30 pm, 5:30 to 8:30 pm; Monday, 10 am to 12:30 pm, 5:30 to 8:30 pm; Tuesday, 10 am to 12:30 pm, 5:30 to 8:30 pm; Wednesday, 10 am to 12:30 pm, 5:30 to 8:30 pm; Thursday, 10 am to 12:30 pm, 5:30 to 8:30 pm; Friday, 10 am to 12:30 pm, 5:30 to 8:30 pm; Saturday, 10 am to 12:30 pm, 5:30 to 8:30 pm. Hide open hours for the week",
        "reviews": "Got a very good and caring treatment from the Doctor. Many gynocological cases are cured by the doctor in my area. My child also get cured multiple times with quick remedies. You should definitely visit for homoepathic treatment here .; He is a best doctor. His behavior so polite. Any kind of  disease properly diogonasis without any medical test. His treatment & suggestions also very good. He is my family doctor.; Dr. Sankar Manna is a very good doctor, his behavior is even better.Any kind of disease properly diogonasis without any medical test. His treatment & suggestions also very good.; He is a very good doctor. He treated my tonsil infection. He diagnosis his patients very nicely.; He is an amazing doctor. I was suffering from several injuries such as leg injuries, muscle cramps and so on but he cured all these problems.; Title: Exceptional Homeopathic Care Post Gallbladder Surgery\n\nReview: …; Really a very good doctor.....i was suffering from several health issues like leg cramps, gastritis, muscle pains and cramps etc and each time I was under his medical supervision.. which gave me incredible good results..I trusts him a lot.; I was suffering from irregular and delayed periods from many years and I've consulted with many doctors and took various medicines.But I did not get any promising results....then i was came under treatment of doctor Sankar Manna..and really …"
    },
    "Dr. Himanshu Gupta General and Laparoscopic Surgeon in West Bengal": {
        "name": "Dr. Himanshu Gupta General and Laparoscopic Surgeon in West Bengal",
        "rating": "4.5",
        "address": "Health World Hospital, Gandhi More, City Center, Durgapur, West Bengal 713216",
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": "drhimanshugupta.getmy.clinic",
        "hours": "Sunday, Closed; Monday, 11 am to 5 pm; Tuesday, 11 am to 5 pm; Wednesday, 11 am to 5 pm; Thursday, 11 am to 5 pm; Friday, 11 am to 5 pm; Saturday, 11 am to 5 pm. Hide open hours for the week",
        "reviews": "Dr. Himanshu Gupta is the worst doctor ever. I would never recommend anyone to go to him. He has no idea about the disease, how the patient should be treated, or about the medicines. All they are concerned with is money. There's another …; Such a very good surgeon doctor 👌,who before writing any medicine, listen your issues after that he check & at the end he wrote the medicine & test.\nThe best thing is he discuss everything with this paitaint ,verry good behaviour & humble person. …; Hi himanshu sir I am ismast zareen you are a very good surgeon and was there when we needed any help and you explained everything clearly you are the one of the best surgeon 😇😇😇 …; Great Doctor and good human being with polite nature.. Truly one of the best surgeon...\nThanks for your good care and concern❤️; Himanshu gupta is a really a good doctor....and laproscopic surgeon; Like a simple man . He has make a miracle power like a god. His behaviour is very good and polite.; Very excellent and nice behaviour of doctors; Great Doctor and good human being with polite nature..\nTruly one of the best surgeon..."
    },
    "Dr. P. K. Pradhan": {
        "name": "Dr. P. K. Pradhan",
        "rating": "5.0",
        "address": "C-42, Bhimpalashri Sarani, Bidhannagar, Durgapur, West Bengal 713212",
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": null,
        "reviews": ""
    },
    "Dr. Subham Das Diabetologist in Durgapur at SUGAM CLINIC": {
        "name": "Dr. Subham Das Diabetologist in Durgapur at SUGAM CLINIC",
        "rating": "4.8",
        "address": "RA 51, SSB Sarani, Bidhan Nagar, More, near Bank Colony, Durgapur, West Bengal 713212",
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": "getmy.clinic",
        "hours": null,
        "reviews": "Dr Shubham Das is a very qualified doctor giving good and genuine  advice about the present health condition .Though he is very young yet he is experienced in his profession with a friendly approach. …; Very impressive. Gives detailed overview of condition and explains abt probable long term effects. Gives less medicines and affordable ones.\nFew suggestions for the clinic …; Very confident and knowledgeable Doctor. And he values our money. No unnecessary visits or medicines.\nExcellent experience; He is very good doctor❤️🙏  I was seeing another doctor in Durgapur for the last 7-8 months, but even though I controlled my blood sugar with food, some of the blood sugar was not under control. I had to take medicines costing 1200 rupees …; Approximately 15 days back I contacted Dr Subham Das first time for diabatic treatment through Video from Deoghar Jharkhand .\nAs per my experience gained  he is a perfect gentleman having friendly approach …"
    },
    "Dr Batra’s Homeopathy, Hair & Skin Clinic": {
        "name": "Dr Batra’s Homeopathy, Hair & Skin Clinic",
        "rating": "4.3",
        "address": "Urvashi Housing Complex, DC Cinema, 3/7, Durgapur, West Bengal 713216",
        "phone": "070450 00666",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": "clinics.drbatras.com",
        "hours": "Sunday, 10 am to 9 pm; Monday, 11 am to 8 pm; Tuesday, 11 am to 8 pm; Wednesday, 11 am to 8 pm; Thursday, 11 am to 9 pm; Friday, 11 am to 8 pm; Saturday, 10 am to 9 pm. Hide open hours for the week",
        "reviews": "Nice experience. I was suffering from severe hair fall I took treatment from here and now I'm satisfied with the treatment as my hairfall in control now. Specially dr Asthana Khatoon Mam's treatment and mentorship was awesome. Thank you; I went to this clinic with my friend . She was facing hairfall issue  after a long time. After the treatment... She gets positive results. Staffs are very supportive. Well maintained. Hygienic. May you people like it.; डाक्टर बतरा का चिकित्सा पद्धति । अच्छा लग रहा है, अभी मेरे पेसेंट का ट्रीटमेंट चल रहा है ,और सुधार भी हो रहा है उम्मीद है कि , यहां का कोर्स पूरा होते होते मेरा पेसेंट पुरा तरह से ठीक हो जाएगा । धन्यवाद्; Effective results..my hair fall and dandruff was completely clear in few months.. thank you dr.batra..all staffs are very frankly and supportive..thank you..; When I first visited Dr.Batra's i was having much hairfall and less hair growth which made me less confident. Within 1month of my treatment I noticed a great change in my hair. The lustre of my hair came back and new follicles were visible. …; I am taking the treatment at Dr. Batra's Homeopathy Durgapur Clinic since January 2023. My hair condition was very poor at the beginning. It is improving over the time. Doctors and staffs are very helpful. They are always ready to clear your doubts. Happy with their service. 🙂 …; I am having treatment from Dr. Batra's Clinic for hairfall and having very good result after their treatment.  I was told that it was a case of genetic hair loss and advised me for a hair treatment for a duration of 4 months and prescribed …"
    },
    "Dr.Bhaskar Ghosh Gastromedicine": {
        "name": "Dr.Bhaskar Ghosh Gastromedicine",
        "rating": "4.7",
        "address": "G1,Bhaskaracharya Sarani, behind Mahal Guest House And Lodge, Bidhannagar, Durgapur, West Bengal 713212",
        "phone": "074072 63036",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": "medigastro.in",
        "hours": null,
        "reviews": "He is just like my father❤❤❤🙏🙏🙏🙏one of the best doctor I hv ever seen ❤❤❤❤❤🙏 …; The doctor is gentle, caring, and has got the healing touch. He's a father figure for me and I've benefitted immensely from his treatment.; I am very satisfied with the overall treatment of Dr Bhaskar Ghosh.His behaviour towards patient also Very good; Beware! I've been in treatment for about 1.5 years, and this doctor likes to keep patients in treatment for a long time and does extra tests to make more money.; Excellent doctor with wonderful diagnosis and management.\nQuality treatment is ensured in this clinic.; Dr Bhaskar Ghosh, as experienced from my brother's treatment proves himself as an outstanding physician. He cares for every patient's problems and responds instantly. I will ever remain grateful to him.; He is one of the senior most doctor practicing in Durgapur with vast knowledge of management of liver disorders as well as other GI symptoms. Apart from his clinical eye his approach towards the patient and time he takes to counsel them has impressed us more.; One of the best GI doctor in Durgapur presently.I have been under his diagnosis for almost an year now. Most of the GI issues that i had an year back are almost non-existent now thanks to him & his diagnosis.; It was a great experience. Please visit medigastro clinic for any gastro related issue."
    },
    "Dr Subhabrata Sarkar": {
        "name": "Dr Subhabrata Sarkar",
        "rating": "5.0",
        "address": "E 23, Columbia St, Sector-2B, Bidhannagar, Durgapur, West Bengal 713212",
        "phone": "098321 65394",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Sunday, 5 to 10 pm; Monday, 5 to 10 pm; Tuesday, 5 to 10 pm; Wednesday, 5 to 10 pm; Thursday, 5 to 10 pm; Friday, 5 to 10 pm; Saturday, 5 to 10 pm. Hide open hours for the week",
        "reviews": "Best 👍👌 …"
    },
    "Dr. Sahnik Banerjee": {
        "name": "Dr. Sahnik Banerjee",
        "rating": "5.0",
        "address": "more, Muchipara, Industrial Area, Durgapur, West Bengal 713212",
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Sunday, Closed; Monday, 8 to 9 pm; Tuesday, 8 to 9 pm; Wednesday, 8 to 9 pm; Thursday, 8 to 9 pm; Friday, 6 to 7:30 pm; Saturday, 8 to 9 pm. Hide open hours for the week",
        "reviews": ""
    },
    "Dr Partha Sarathi Chanda": {
        "name": "Dr Partha Sarathi Chanda",
        "rating": "4.7",
        "address": "4,5 Near NIM Durgapur City Centre, Doctor's Colony, Durgapur, West Bengal 713209",
        "phone": "0343 254 6600",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": "drparthasarthichanda.com",
        "hours": null,
        "reviews": "Very good Doctor and nice behaviour; Veey good behaviour and knowledgable"
    },
    "Dr Subir Mukherjee (Dentist)": {
        "name": "Dr Subir Mukherjee (Dentist)",
        "rating": "4.0",
        "address": "A-2/6, Allauddin Khan Bithi, Street Number 2, Non-Company Housing Estate, City Center, Durgapur, West Bengal 713216",
        "phone": "097320 52324",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Sunday, 10 am to 2 pm, 6 to 9 pm; Monday, 10 am to 2 pm, 6 to 9 pm; Tuesday, 10 am to 2 pm, 6 to 9 pm; Wednesday, 10 am to 2 pm, 6 to 9 pm; Thursday, Closed; Friday, 10 am to 2 pm, 6 to 9 pm; Saturday, 10 am to 2 pm, 6 to 9 pm. Hide open hours for the week",
        "reviews": "He is totally doing business with clients.  His Asistant Mr. Paltu is very bad for clients...Their motives are always doing crowns which cost each 5000/-. I am sufferer due to their wrong treatment.  I have only 1 tooth cavity but He …; I went for a tooth filling and it was done smoothly. Thank you, doctor."
    },
    "null": {
        "name": null,
        "rating": null,
        "address": null,
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": null,
        "reviews": "Healthworld hospital doesn't deserve any star. Horrific experience...terrific experience...worst nursing behavior...they misbehave with patient...A doctor Mr. Suman Saha was playing video games and operating share market chart at the time …; The worst hospital in all of Durgapur. I would never recommend this dreadful hospital to anyone. They have brutally murdered my mother-in-law. They don't have any proper infrastructure, and the doctors are worthless. Her body C-reactive …; One of the best experiences that I had personally when my mother in law survived a stroke . Dr Sunil Kumar has been empathatic and gave us the right treatment; Hospital doctor staff nothing good at all, hospital runs by nurses, onec u admit here u can't find any goodness .you may see some good reviews but believe me these are fake. My father had admitted here for a orthopaedic surgery. After …; It's name should be changed not health world...\"LOOT WORLD\"\n\nfor basic ear lobe surgery to repair under local anastasia .. Dr Kaushik paul …"
    },
    "Dr. Tania Mukherjee | ENT Specialist | Coblation Technology Surgeon | ENT Doctor | Durgapur": {
        "name": "Dr. Tania Mukherjee | ENT Specialist | Coblation Technology Surgeon | ENT Doctor | Durgapur",
        "rating": "4.9",
        "address": "Ortho ENT Clinic, D8, Bidhan Park Rd, Sector 1, Durgapur, West Bengal 713206",
        "phone": "087770 32006",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Sunday, 9 to 10:30 am; Monday, 9 am to 9 pm; Tuesday, 9 am to 9 pm; Wednesday, 9 am to 9 pm; Thursday, 9 am to 9 pm; Friday, 9 am to 9 pm; Saturday, 9 am to 9 pm. Hide open hours for the week",
        "reviews": "I was very worried about my daughter health.she was not eating anything and used to feel lethargic all time.someone told me to visit dr tania mam .she adviced only 1 blood test and seeing the result gave only 2 medicine. She also told that …; Tania mam is an excellent surgeon. We are so proud of her. She takes full care of patients and also that patient goes home safely esp.i would highly recommend her as a best ENT doctor in town; When various people suggested mission hospital and vivekananda hosp.. Krishna showed me the way when Google showed Dr. Tania Mukherjee. Her reviews were excellent. People generally don't write good about others but here I found all are so …; i am tania mam patient from kolkata .she did my rhinoplasty surgery in 2018.she did augmentation rhinoplasty .it was done with utmost care.mam was with me throughout the journey and guided me so well through the post operative journey.i was …; My experience is awesome one of the best ent specialist dr. Taniya Mukherjee well behaved. My throat infection is recovering i am satisfied with her; Tania mam is an excellent surgeon.we are so proud of her .God bless her.dhe operated on my mother .Tania mam informed that my mother is suffering from facial paralysis due to cholesteoma . immediate surgery is required to save her life.i …"
    },
    "Dr. Neha Agrawal- MBBS, MD, DM-Endocrinologist": {
        "name": "Dr. Neha Agrawal- MBBS, MD, DM-Endocrinologist",
        "rating": "4.8",
        "address": "Assure clinic, 54 FEET SARADA PALLY, Benachity, Durgapur, West Bengal 713213",
        "phone": "080177 02837",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": "drnehaagrawal.getmy.clinic",
        "hours": "Sunday, Closed; Monday, 10 am to 12 pm, 3 to 7 pm; Tuesday, 10 am to 12 pm, 3 to 8 pm; Wednesday, 10 am to 8 pm; Thursday, 10 am to 7 pm; Friday, 10 am to 8 pm; Saturday, 9:30 to 11:30 am. Hide open hours for the week",
        "reviews": "She is very good with diagnosis and providing quick solution. She has very good knowledge in medical field and recommended good line of treatment. I highly recommend her.; I am diabetic patient and taking her treatment since 6 year. Patient's problem he listen very calmly and carefully. her treatment suit me .  She gives very good response I am fully satisfied with her . She is my favorite doctor.; I consulted her for my diabetes and general problems like cough and cold and her medicines really suited me. It was a very good experience with her as she listens to the problem with a calm mind. Will definitely go back to her everytime now.; I was suffering from brain tumor(hormonal) and she cured me 90%, she always stayed in contact with me and should reply without any delay, she helped me a lot to be cured, listened to all my problems calmly and carefully,  my most trusted doctor. I'm still under her treatment for my tumor hopefully I'll be cured in 3 months or so.; She is very good with knowledge and skills about endocrine disease.also polite and nice person . Best doctor for diabetes and thyroid; Mam I m 20 years old and I have growth deficiency...Pls help me mam I m in serious problem with this😭.... Can I get a appointment in hospital mam pls reply …"
    },
    "Dr. Banashree Das": {
        "name": "Dr. Banashree Das",
        "rating": "4.0(34)",
        "address": "G7C7+F4R, DVC DTPS Colony, Durgapur, West Bengal 713215",
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Sunday, Open 24 hours; Monday, Open 24 hours; Tuesday, Open 24 hours; Wednesday, Open 24 hours; Thursday, Open 24 hours; Friday, Open 24 hours; Saturday, Open 24 hours. Hide open hours for the week",
        "reviews": ""
    },
    "Dr. T.S. ghosh house": {
        "name": "Dr. T.S. ghosh house",
        "rating": "5.0",
        "address": "G88W+QMC, Aranyak East, Bidhannagar, Durgapur, West Bengal 713212",
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": null,
        "reviews": "His behaviour is too good...; Nice"
    },
    "Dr Ramprasad Gorai (Pulmonologist & Critical Care Specialist)": {
        "name": "Dr Ramprasad Gorai (Pulmonologist & Critical Care Specialist)",
        "rating": "4.8",
        "address": "City Centre, C-49 Commercial Area, Gandhi More, Durgapur, West Bengal 713216",
        "phone": "081700 52720",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": "eka.care",
        "hours": "Sunday, Closed; Monday, 12 to 5 pm; Tuesday, 12 to 5 pm; Wednesday, 12 to 5 pm; Thursday, 12 to 5 pm; Friday, 12 to 5 pm; Saturday, 12 to 5 pm. Hide open hours for the week",
        "reviews": "My son was under his treatment in healthword durgapur. The way he took care and make my son cured is excellent.\nI wish Dr. R. P. Gorai a very successful career in his domain. Thank you sir.; He is one of the best Pulmonologist in Durgapur. Must visit him if you're really facing serious issues. Gem in a true sense. He is a very polite person. Really fond of his Counseling.; Dr.R.P.Gorai is an excellent Doctor...We are amazed by his treatment and kind behaviour.He is an angel to us...Gratitude and respect from me.; He is one of the best Pulmonologist in Durgapur. He is God to me...because He recovered my father from death. Thank you sir🙏🙏🙏 …; One of the best Doctor of my life. He saved my Mother's life. He is too good.; Doctor's behaviour is nice and the good part is he listens attentively to patients and acts accordingly.; He is a superb Doctor as well as Humble person. My father was suffering for cough during last 4 years. Lots of doctor's chamber we jave visited and take long treatment also, but no improvement was notified But after getting his treatment …; My father was admitted in Health World Hospital, Durgapur under supervision of Dr. Ram Prasad Gorai.  During admission he had explained briefly about the problems and solution. It was very important for any patients relative. During 12 days …"
    },
    "Dr. Krishnendu (child specialist)": {
        "name": "Dr. Krishnendu (child specialist)",
        "rating": "3.8",
        "address": "G8PV+F63, Bidhan Park Rd, Shankarpur West, Kaliganj, Durgapur, West Bengal 713206",
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": null,
        "reviews": "One of the third class human creature... Simply he is doing Money laundering playing with the baby's lives, In the name of treatment he just rag parents who does not have strong financial or political background. For money he can let the patient die. by God grace I have escaped my baby and got her life back.; Good n well doctor; Worst pediatric doctor I have ever seen..; He used to prescribe too many medicines.; Good doctor; Very good dr ....; Prescribes too much of unnecessary medicines; The best of child doctor; A very good paediatrician"
    },
    "DOCTOR:S CLINIC": {
        "name": "DOCTOR:S CLINIC",
        "rating": "4.4(11)",
        "address": "A-9, Abanindra Bithi, Non-Company Housing Estate, City Center, Durgapur, West Bengal 713216",
        "phone": "098004 60904",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": null,
        "reviews": ""
    },
    "Dr Raychaudhury Clinic": {
        "name": "Dr Raychaudhury Clinic",
        "rating": "4.4",
        "address": "ZLO-17, Dr Zakir Hussain Ave, Zonal Market, Durgapur, West Bengal 713206",
        "phone": "093326 14032",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": "theskinclinic.wordpress.com",
        "hours": "Sunday, 9 am to 1 pm, 5 to 8:30 pm; Monday, 9 am to 1 pm, 5 to 8:30 pm; Tuesday, 9 am to 1 pm, 5 to 8:30 pm; Wednesday, 9 am to 1 pm, 5 to 8:30 pm; Thursday, 9 am to 1 pm, 5 to 8:30 pm; Friday, 9 am to 1 pm, 5 to 8:30 pm; Saturday, 9 am to 1 pm, 5 to 8:30 pm. Hide open hours for the week",
        "reviews": "The only dermatologist from vellore whome we got in our city only. The best diagnosis ever for critical case and cosmetic treatment as well. No need to go out of Westbengal even to Kolkata. For peripheral places I would suggest to the patients to go for Dr. Tanumoy only.; One of the most renowned and best dermatologist in india with respect to diagnosis and treatment , we are proud to have dermatologist of that stature in West Bengal.; Dr. Tanumay Raychaudhury is currently one of the most renowned dermatologist of India. We are privileged to have him in our city.; It's just awesome...I don't think we can find best clinic than this....from my opinion this is one of the best clinic around u...u should come one tym if u have any type of skin related problems. ..; Best dermatologist in our state. We are proud for him...; Best dermatologist in durgapur; Best clinic...; Wow"
    },
    "Ortho ENT Clinic": {
        "name": "Ortho ENT Clinic",
        "rating": "4.9",
        "address": "D8, Bidhan Park Rd, Sector 1, Durgapur, West Bengal 713206",
        "phone": "087770 32006",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Sunday, 9 to 10:30 am; Monday, 9 am to 9 pm; Tuesday, 9 am to 9 pm; Wednesday, 9 am to 9 pm; Thursday, 9 am to 9 pm; Friday, 9 am to 9 pm; Saturday, 9 am to 9 pm. Hide open hours for the week",
        "reviews": "I have sent many patients to both Sutamu Sir and Tania madam for orthopaedic and ENT surgery. All of them are doing well and are very satisfied. I can confidently recommend both Sir and Madam for any orthopaedic and ENT surgery. Ortho ENT Clinic is a hope for all these people who cannot afford big multi-speciality hospital.; My brother pradhan hazra was suffering with both lower limb weakness and  bladder incontinence. Dr. Sutanu Goswami has done his spine surgery & now he is able to walk independently & there is no bladder incontinence.  Thanks to Dr. Sutanu Goswami.; i am visit first time for ear problem, Her way of treating patients is very commendable. Her behavior with me and her prescribed medicines are too much marvelous.; Dr Tanya mam is one of the best ENT doctor ever I seen.her behaviour is friendly towards the patient . So fabulous wonderful gorgeous behaviour,too knowledgeable doctor.....; Taniya Mam is very good ENT doctor.Her Behaviour is very good and she understands patient condition like family condition,Health Condition and also patient feeling also.; Dr. Tania madam is very generous and polite doctor who provides utmost care to her patients with ease of comfort. She managed my emergency when i was not getting help from anywhere.  Highly recommended to others.; I am soumitra chatterjee, I safar ankylosing spondilites disease last 12 years my both hip joint are replaced, my right knee are completely damaged, my right knee operated dr. Sutanu goswami and cured me. Thanks dr. Sutanu goswami.; Dr Tania Mam is the one to go to for all your ENT problems if you’re in Durgapur or it’s vicinity. Highly recommended.; Thank you so much Dr Tania Mukharjee for providing me excellent medical and physical care. I was suffering with Rhinitis and Dr Tania provided the best treatment and she is the best ENT specialist I have ever met as she resolved my …"
    },
    "Dr Niladri Sen": {
        "name": "Dr Niladri Sen",
        "rating": "4.5",
        "address": "Vision Nativity, CA 4, Ambedkar Sarani, Non-Company Housing Estate, City Center, Durgapur, West Bengal 713216",
        "phone": "094750 80804",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Sunday, 9:30 am to 7 pm; Monday, 10 am to 7:30 pm; Tuesday, 9 am to 7:30 pm; Wednesday, 9 am to 7:30 pm; Thursday, 9 am to 7:30 pm; Friday, 9 am to 7:30 pm; Saturday, 9:30 am to 7:30 pm. Hide open hours for the week",
        "reviews": "One of the best gynecologist in Durgapur. He is always available for his patients. He is very supportive for his patients and try to accommodate their needs and give the best treatment possible. He really made my pregnancy journey a wonderful one. Thank you Sir.; To me, he is my God🙏 Awesome behavior, very polite, always helpful, best Gynecologist I ever seen. …; Great Doctor. Great human being. Great experience. Dr.Niladri Sen is great.; I have nothing say about your work ..you r not only a good doctor you r such a God for mah family and me also...Best Gynecologist in durgapur ..Amazing you and your work Dr.Sen...Thank You..; Very Good Doctor 💊💊🙏🏻🙏🏻🙏🏻🙏🏻🙏🏻 …; Worst doctor ever, very disrespectful behaviour, such an uncultured mannerless human being!; Best best best doctor ❤️; Very Friendly & Experience Doctor. 👍 …; Open-hearted n free-minded person......\nI recovered soon under his surgery....."
    },
    "Dr. Nishant Kumar": {
        "name": "Dr. Nishant Kumar",
        "rating": "5.0",
        "address": "And MISSION clinic city centre, The MISSION hospital, Bidhannagar, Durgapur, West Bengal 713212",
        "phone": "098008 81669",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": "eka.care",
        "hours": "Sunday, Closed; Monday, 11 am to 10 pm; Tuesday, 11 am to 10 pm; Wednesday, 11 am to 10 pm; Thursday, 11 am to 10 pm; Friday, 11 am to 10 pm; Saturday, 11 am to 10 pm. Hide open hours for the week",
        "reviews": "This is an appreciation post for Dr. Nishant Kumar as under him my mother underwent an ENT surgery. He is one of the best ENT surgeons in Durgapur.; I recently had the pleasure of visiting Dr. Nishant Kumar for an ENT consultation and was thoroughly impressed with his level of care and expertise. Dr. Nishant Kumar is a highly skilled specialist who truly goes above and beyond for his …; Best doctor and wb best city"
    },
    "Dr. Rohan Bhattacharjee MBBS MD Fellow (JIPMER) | Dermatologist in Durgapur I Skin, Hair, & Pigmentation treatment": {
        "name": "Dr. Rohan Bhattacharjee MBBS MD Fellow (JIPMER) | Dermatologist in Durgapur I Skin, Hair, & Pigmentation treatment",
        "rating": "4.9",
        "address": "Avishkar Diagnostics, CA-03, Ambedkar Sarani, Ambuja, Durgapur, West Bengal 713216",
        "phone": "089725 87077",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": "dermdocrohan.com",
        "hours": "Sunday, Closed; Monday, 6:30 to 8 pm; Tuesday, 5:30 to 7 pm; Wednesday, 5:30 to 7 pm; Thursday, 5:30 to 7 pm; Friday, 5:30 to 7 pm; Saturday, 5:30 to 7 pm. Hide open hours for the week",
        "reviews": "Such an amazing and wonderful Doctor .. his words itself can soothe a person’s ailments . He was very kind to my father and me . We visited him for my father’s skin problem.. His behaviour was heart touching .. and he has wonderfully treated my father’s problem .; I'm visiting Dr. Rohan Bhattacharjee for my skin-related concerns and honestly, he's the best. He's patient to answer my queries I have regarding my skin.\nAlthough, I'm a skeptical person but, putting my trust on Doctor was the best …; It was a very good experience. The Dr is generous enough to make me comfortable. I didn't feel any pain during this procedure.; Glad to find such an amazing services from Dr.Rohan Bhattacharjee......and literally can seen the result too fast even with no recurrence and must to mention such an awesome person with immense polite behaviour🙂 …; Best Dermatologist in eastern zone with a glorified academic background and wonderful communication skill. Don’t spare your money in beauty parlours just contact him for any kind of skin problems to hair loss.; According to my opinion, the doctor is dishonest. He only prescribes medicines which is available in only Avishkar diagnostic centre. I tried asking for generic name of the medicine but the doctor asked me to buy Branded medine for cut money; Dr. Bhattacharjee is awesome. I visited him twice for my grandma's skin checkup. My grandma's skin is recovering well.....; He is not only an excellent doctor. He is simple and superb human being."
    },
    "Dr Arindam Chatterjee. Pain Specialist": {
        "name": "Dr Arindam Chatterjee. Pain Specialist",
        "rating": "5.0",
        "address": "The mission hospital, Imon Kalyan, Bhimpalashri Sarani, Durgapur, West Bengal 713212",
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Sunday, Closed; Monday, 10 am to 2 pm; Tuesday, 10 am to 2 pm; Wednesday, 10 am to 2 pm; Thursday, 10 am to 2 pm; Friday, 10 am to 2 pm; Saturday, 10 am to 2 pm. Hide open hours for the week",
        "reviews": "Dr. Arindam is a gentleman, polite and a humble person. He patiently listens to our problems and guids us efficiently. His expertise has helped my mother,wife and me from acute pain in knee joints and slip discs issues. He is available all the time to help his patients. Really grateful to him for his service and highly recommend to all.; Just consulting yesterday..He is Very well behaved,humble and polite person.\nListen all the history carefully and then advice such a good manner anyone can understand. …; Dr Chatterjee is an expert in pain management and grateful to him for ameliorating my mother's chronic pain caused by Lumbar stenosis through TFESI. Extremely professional and down to earth and it is always wonderful to interact with him.; Dr. Arindam has transformed my life. After six months of relentless back pain and failed treatments, his expertise and dedication have nearly eradicated my suffering that too within a very short period. He's not just a doctor; he's a beacon of hope for chronic pain sufferers. Highly recommended.; It's one of the best treatments we came across. The results are amazing. My wife is having this treatment under Dr. Arindam Chatterjee and she is already recovering so fast. The condition is good and the pain is almost gone.; My mother was suffering pain because of the disc prolapse( Lumber Sacral), then I consulted Dr Arindam Chatterjee. Since last year I've been seeing this doctor and my mother's condition is much better. He is one of the best doctors in Mission Hospital. Very much satisfied , both with treatment and behaviour.😊 …; Dr Arindam is very good doctor.\nBehaviour is good listens problems and gives time to patient, professional skills are good, It was nice experience for me at pain clinic.; Excellent Doctor, His way of talking and care for patients act as a remedy for the pain, nice to have treatment from such a great doctor, God bless you Sir."
    },
    "Dr Amitava Ghosh": {
        "name": "Dr Amitava Ghosh",
        "rating": "3.5",
        "address": "D 250, blue Ford street, Bidhannagar, Durgapur, West Bengal 713212",
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": null,
        "reviews": "Very very rude behaviour....today i visit his chamber with my father..his assistant is very unofficial she don't know how behave with customer..and doctor also very rude..rudely behaviour; Perfect"
    },
    "Dr Keshav Garg Interventional Pain Specialist": {
        "name": "Dr Keshav Garg Interventional Pain Specialist",
        "rating": "5.0",
        "address": "Healthworld hospitals, C-49, Mahatma Gandhi Rd, beside Gandhimore, Gandhi More, Recol Park, Durgapur, West Bengal 713216",
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": "drkeshavkumargarg.getmy.clinic",
        "hours": "Sunday, Closed; Monday, 10 am to 4 pm; Tuesday, 10 am to 4 pm; Wednesday, 10 am to 4 pm; Thursday, 10 am to 4 pm; Friday, 10 am to 4 pm; Saturday, 10 am to 4 pm. Hide open hours for the week",
        "reviews": "Dr. Keshav is an excellent Pain Specialist. He is a competent and kind doctor who treats his patients with compassion and imparts effective treatment."
    },
    "Dr Sandip Mondal": {
        "name": "Dr Sandip Mondal",
        "rating": "4.8",
        "address": "ESI Hospital, Dr Zakir Hussain Ave, Bidhannagar, Durgapur, West Bengal 713206",
        "phone": "093336 89501",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": "lybrate.com",
        "hours": null,
        "reviews": "Terribly bad doctor! My wife was taking treatment for her pregnancy. We lost our child because of his inefficiency in making decisions and lack of subjective knowledge. Now, he lies, using various medical terminologies to hide his …; Very good, dynamic doctor in durgapur  with well behavior...; He is a quack.\nMy daughter suffered an allergic reaction to vaccine yesterday could have escalated to anaphylactic shock. Dr gave an injection, then simply said Hospital le jao, hum kuch nhn kar dsakte.; One of the best ob-gyn Dr in Durgapur. My wife's entire pregnancy was under his supervision and now we are a complete family with a healthy baby. Thank you sir, you are more than a doctor for us. Durgapur needs doctor like you.; For me he is more than a Doctor . We have never seen such a responsible, sensible doctor with full of humanity.Thank you for your patience, professionalism, hard work, and commitment to excellent medical care. You are such an amazing …; Dr Sandip Mondal is one of the best gynecologist in Durgapur. As a human being he is polite and just which, I think , are essential qualities for being a Doctor. I consulted him during my pregnancy and got the right way to be a happy mother of a healthy child.; One of the best gynaecologist in durgapur. Not only a good doctor but a great person ❤️"
    },
    "City medical stores doctors chamber": {
        "name": "City medical stores doctors chamber",
        "rating": "5.0(1)",
        "address": "City Centre Market, Abanindra Bithi, City Center, Durgapur, West Bengal 713216",
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": null,
        "reviews": ""
    },
    "Dr S K Kundu-Child Special": {
        "name": "Dr S K Kundu-Child Special",
        "rating": "5.0",
        "address": "A-22, SSB Sarani, Bidhannagar, Durgapur, West Bengal 713212",
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": null,
        "reviews": ""
    },
    "Dr u r Choudhury.": {
        "name": "Dr u r Choudhury.",
        "rating": "5.0",
        "address": "G9F9+57X, Shibtala Rd, Arrah Kalinagar, Durgapur, West Bengal 713212",
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": null,
        "reviews": "Very experienced doctor."
    },
    "Dr Debasish Chatterjee | Surgical Oncologist": {
        "name": "Dr Debasish Chatterjee | Surgical Oncologist",
        "rating": "4.9",
        "address": "The Mission Hospital Imon, Bhimpalashri Sarani, Bidhannagar, Kalyan, Durgapur, West Bengal 713212",
        "phone": "079089 92837",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": "drdebasishchatterjee.co.in",
        "hours": "Sunday, 9 am to 5 pm; Monday, 10 am to 5 pm; Tuesday, 9 am to 5 pm; Wednesday, 9 am to 5 pm; Thursday, 9 am to 5 pm; Friday, 10 am to 5 pm; Saturday, 10 am to 5 pm. Hide open hours for the week",
        "reviews": "The best doctor I have ever met, Dr. Debasish Chatterjee, is very kindhearted and careful with his parents. He is loaded with confidence and simplicity.\nWe have had very good experience with him, from the first consultation to the …; Dr. Debasish Chatterjee is an excellent human being. His behavior is so cordial with patients. Encouraging doctor as well as caring. My father underwent a crucial surgery under him and now feels better than before.  Thank you sir for your great service.; Dr. Debasish Chatterjee's care for my uncle's ileostomy closure and hernia surgery was outstanding. He not only performed the surgery smoothly but also kept our family informed about its completion proactively. What an amazingly humane act! …; Dr.Debasish Chatterjee has been extraordinary as usual in responsiveness, pre and post surgery guidance and of course with his brilliant skills in complex surgeries.. my mother has successfully undergone a 7 hour surgery and recovering well..; If I could give 5000 stars, I would. I've been seeing Dr.Debasish Chatterjee for nearly 3 to 4 months. He is very gentle and humble in his behaviour. I am 29 years old and had undergone through laparoscopic incisional hernia repair …; overall nice experience. the doctor is very much cordial. he explains patient condition and surgical process in details with the patients. he always receives phone call and guided properly. we must say he is a fantastic human being as well as a good oncolgy surgeon."
    },
    "Dr Sk Golam Masud": {
        "name": "Dr Sk Golam Masud",
        "rating": "5.0",
        "address": "City Park Rd, Shankarpur West, Kaliganj, Durgapur, West Bengal 713206",
        "phone": "093320 23383",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": "cybo.com",
        "hours": null,
        "reviews": ""
    },
    "Medigastro Clinic And Diagnostic Centre": {
        "name": "Medigastro Clinic And Diagnostic Centre",
        "rating": "4.6",
        "address": "G1, Saptarshi Sarani, behind Mahal Guest house and Lodge, Bidhannagar, Durgapur, West Bengal 713212",
        "phone": "074072 63036",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": "medigastro.in",
        "hours": "Sunday, 10 am to 8 pm; Monday, 10 am to 8 pm; Tuesday, 10 am to 8 pm; Wednesday, 10 am to 8 pm; Thursday, 10 am to 1:30 pm; Friday, 10 am to 8 pm; Saturday, 10 am to 8 pm. Hide open hours for the week",
        "reviews": "It's one of the best that I have experienced. Would surely recommend people to visit in case of any problem; Well experienced doctor and you get the best service in durgapur for various types of tests; It's a good clinic. Patients get good treatment.; Good experience.; Excellent service excellent behaviour; Quality job at reasonable prices; Very good"
    },
    "Dr. Asit Kumar Chatterjee Clinic": {
        "name": "Dr. Asit Kumar Chatterjee Clinic",
        "rating": "5.0",
        "address": "G984+G6X, Bank Colony, City Center, Durgapur, West Bengal 713212",
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Sunday, 9 to 10:30 am; Monday, 9:30 to 10:30 am; Tuesday, Closed; Wednesday, 9:30 to 10:30 am; Thursday, 9:30 to 10:30 am; Friday, 9:30 to 10:30 am; Saturday, 9:30 to 10:30 am. Hide open hours for the week",
        "reviews": ""
    },
    "Prayas Foundation": {
        "name": "Prayas Foundation",
        "rating": "4.8",
        "address": "1, Tarashankar Sarani, SAIL Co-operative, City Center, Durgapur, West Bengal 713216",
        "phone": "074790 13510",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": "prayas-foundation.com",
        "hours": "Sunday, Closed; Monday, 9 am to 8 pm; Tuesday, 9 am to 8 pm; Wednesday, 9 am to 8 pm; Thursday, 9 am to 8 pm; Friday, 9 am to 8 pm; Saturday, 9 am to 8 pm. Hide open hours for the week",
        "reviews": "I consulted with Dr. Dipanwita Sen mam for my Pregnancy. She is very efficient and very kind hearted with lots of smile in her face. Every time I consulted with her I got very much confidence. Done delivery under her and she was excellent …; I met with Dr. Dipanwita Sen  Mam from my 5th month of pregnancy. Every visit she greeted us with her smile. She guided me properly during my pregnancy. If there was any problem she gave a quick solution which encouraged me to continue my …; My wife recently had her delivery under the care of Dr. Dipanwita Sen, and we couldn’t be more grateful for the exceptional care and support she provided. Dr. Sen’s expertise as a gynecologist was evident throughout the entire process. Her …; Prayas Fondation Best Doctor's Clinic  , Stuff Behaved Excellent  & Coaparation Have Best With All Patient & Patient Family's Members. I have been seeing doctors at prayas foundation for the last 9 month's to Dr Dipanwita Madam  , I am very satisfaction Doctor and this foundation stuff  , So Thank You Prayas Foundation of every one  .; Thank you for giving us our sunshine.you(Dr.Dipanwita Sen)are a great doctor and also having a great human being.Thank you mam for gifting me a smooth and fabulous pregnancy journey.Stuff are also very polite and behaviour nicely.No doubt she is the best gynecologist ever.; I would like to thanks Dr. Dipanwita Sen and team and all the members of Prayas Foundation for helping me to get the wonderful journey of motherhood. They supported me each and every time. Thank you so much. I really appreciate your work."
    },
    "Dr Golam Masud": {
        "name": "Dr Golam Masud",
        "rating": "5.0(1)",
        "address": "Educational trust, City Tower, Dr Sekh Golam Masud, Muchipara, Durgapur, West Bengal 713212",
        "phone": "093320 23383",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": "demchblog.wordpress.com",
        "hours": null,
        "reviews": ""
    },
    "DR. P ROY": {
        "name": "DR. P ROY",
        "rating": "5.0",
        "address": "Subhas Pally, Michael Sarani, Benachity, Durgapur, West Bengal 713213",
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": "drproyayurvedic.blogspot.com",
        "hours": "Sunday, 8 am to 9:30 pm; Monday, 8 am to 9:30 pm; Tuesday, 8 am to 9:30 pm; Wednesday, 8 am to 9:30 pm; Thursday, 8 am to 9:30 pm; Friday, 8 am to 9:30 pm; Saturday, 8 am to 9:30 pm. Hide open hours for the week",
        "reviews": "seriously he is a best ayurvedic doctor in durgapur.I'm very helpful 😊 my all problems are go way. …; Very understanding and friendly doctor...  Thanq dr. Patit roy sir....; Very nice treatment and behaviour.; Works well and very nicely; Very good treatment; Very good"
    },
    "Littles' Clinic": {
        "name": "Littles' Clinic",
        "rating": "4.1",
        "address": "B-32, Michael Faraday, Nazrul Sarani, City Center, Durgapur, West Bengal 713216",
        "phone": "077186 70475",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Sunday, 6 to 9 pm; Monday, 6 to 9 pm; Tuesday, 6 to 9 pm; Wednesday, 6 to 9 pm; Thursday, 6 to 9 pm; Friday, 6 to 9 pm; Saturday, Closed. Hide open hours for the week",
        "reviews": "He is too good and very caring doctor,but we need a contact number where we can get in touch with him if any emergency happened during non-clinic time or at midnight.; Outstanding Doctor with Compassion and Expertise!\n\nMy clild has been treated by Dr.Subhasish Chakrabarti since she was born, and I …; Not sure why he will always give antibiotics without any test report. He provides antibiotics indiscriminately. He needs to stop providing broad spectrum antibiotics. It will cure you and make you feel good quickly(that's how most doctors …; Doctor is good. But behaviour of the receptionist (who writes name of patients) is too much bad. When we call for an appointment, he will response with harsh words. He doesn't maintain a least manners. This is not only a one time incident.; Doctor is good  But the manager who writes name is of different type. He somehow keeps his phone busy & give advantage to his familiar faces & denies to write name of others. So, I decided to go to different doctor.; Clinic for pediatric and children. Dr. Subasish Chakraborty a renowned pediatrician of Durgapur. Situated at Micheal Faraday Sarani, City Centre, Durgapur-713216. Had treated my children.; Best Dr in durgapur."
    },
    "Dr Sanjay Kumar Ghosh Dermatologist Durgapur": {
        "name": "Dr Sanjay Kumar Ghosh Dermatologist Durgapur",
        "rating": "4.6",
        "address": "22/7, East Ave, Bengal Ambuja Housing Complex, City Center, Durgapur, West Bengal 713216",
        "phone": "094713 68158",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Sunday, 9 am to 5 pm; Monday, 9:30 am to 12:30 pm, 4:30 to 6:30 pm; Tuesday, 9:30 am to 4:30 pm; Wednesday, 9:30 am to 12:30 pm, 4:30 to 6:30 pm; Thursday, 9:30 am to 12:30 pm, 4:30 to 6:30 pm; Friday, 9:30 am to 12:30 pm, 4:30 to 6:30 pm; Saturday, 4:30 to 6:30 pm. Hide open hours for the week",
        "reviews": "My husband was infected with skin tuberculosis. For six months we went to several doctors but we could not get the correct diagnosis, until we met Dr. Sanjay Kumar ghosh …; Great doctor and a great human at heart\nNot only sir saved me from so many misdiagnosis from other doctors but rather saved my life from the darkest phase of my life I am so much thankful to sir for …; We had been seeing Dr. Ghosh from quite sometime now. He had helped our entire family with various skin and other issues. …; I had consulted with him for my son skin problem. But after giving his medicine the problem was increased. I had visited three times but every time he had prescribed new medicines and none had worked. I had lost my money and time and more over my son suffered a lot.; First of all a great big thanks to you sir(Doctor) I am a student of Allen and my home town is far from Durgapur, i stay in hostel and i came here in the hostel with itchiness almost all over my body i went back home showed 3 different …"
    },
    "Dr Sutanu Goswami": {
        "name": "Dr Sutanu Goswami",
        "rating": "5.0",
        "address": "Ortho ENT Clinic, D8, Bidhan Park Rd, sector 1, Durgapur, West Bengal 713206",
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Sunday, Closed; Monday, 9:30 am to 9 pm; Tuesday, 9 to 10 am; Wednesday, 9 to 10 am; Thursday, 9 am to 9 pm; Friday, 9 am to 9 pm; Saturday, 9 to 10 am. Hide open hours for the week",
        "reviews": "I was suffering from both hip pain & stiffness. Even I can not sit on chair at that time. I have also a history of back pain & this was diagnosed as ankylosis spondylitis. Both the hip joints are affected. Dr. Sutanu goswami has done a …; My brother was suffering with both lower limb weakness & bowel bladder issues since last 3-4 month.  Dr. Sutanu Goswami has done his surgery ( spine surgery) , & now he walk independently & there is no bladder issues at this moment. Thanks to dr. S. Goswami; Myself Chaitali Das from Durgapur undergone surgery of L4-L5 Spine by Dr. Sutanu Goswami. Now I didn't feel pain in left ankle and left pelvic dic. I can walk now without pain. …; Has admitted with difficulty in weight bearing over right leg, has diagnosed as neck femur fracture. Dr. S. Goswami has performed Total Hip Replacement. Now I can walk independently. Thanks to Dr. Sutanu Goswami.; One of the most reliable and experienced orthopedic & spine surgeon in our locality.\nMy 72 years sister's spine surgery done vary smoothly and successfully.; My self tanmoy das. I am a student of sanaka. During playing cricket My left hand's thumb is factured .I can't move it. Dr Sutanu Goswami fixed it by operation. Now my thumb is in well condition.; I did Rt TKR with Dr Sutanu Goswami in may 2023. I am doing very well. I can walk as long as I want. I will also do my other knee this year."
    },
    "DR. BISWAJIT BANIK/ SENIOR ENT CONSULTANT SURGEON HEALTHWORLD HOSPITAL": {
        "name": "DR. BISWAJIT BANIK/ SENIOR ENT CONSULTANT SURGEON HEALTHWORLD HOSPITAL",
        "rating": "4.8",
        "address": "Healthworld hospital, Gandhi More, City Center, Durgapur, West Bengal 713216",
        "phone": "088604 47881",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Sunday, Closed; Monday, 9 am to 5 pm; Tuesday, 9 am to 5 pm; Wednesday, 9 am to 5 pm; Thursday, 9 am to 5 pm; Friday, 9 am to 5 pm; Saturday, 9 am to 5 pm. Hide open hours for the week",
        "reviews": "Thank you DR. Biswajit Banik sir, for my successful ear operation. You are the real hero of it's own field, I did not think that my ear operation was 100 percent successful. But you really do 100 percent successful. I never forget you. Health world is right place for ear operation.; I personally thank Sir, Dr. Biswajit Banik, really I have suffered tonsils pharyngitis and pain in my neck so many months I have visited many ent and gastroenterology doctors , but sorry to say no one cure properly as Dr. Sir Biswajit Banik. Once again I will definitely revisit to Dr. Chamber to say thank to him.; I shall like to give him all the stars for his best n best treatment. It was very precious for me to have a consult with Dr. Biswajit Banik as an ENT specialist for my mother. My mother was suffering from a severe problems in her ears at …; I really appreciate the way you dealt with me having anxiety and my nasal issue. I can now put a full-stop into my suffering. Thanks a lot doctor for helping me breathe better now.; In an accident, I lost my hearing power.  With your treatment I regained my hearing. I have no words to thank you.  Many thanks to you and your team.; Such a  great ENT doctor very kind and helpful thanks for the treatment ☺️; One of the best ENT Doctor ..... Amra khub satisfied.... Thank you Sir.; One of the best ENT specialist.. highly recommended..\nVery good and polite.."
    },
    "Sushoma Homeo Clinic - Dr Raju Das": {
        "name": "Sushoma Homeo Clinic - Dr Raju Das",
        "rating": "4.5",
        "address": "H74J+MQ8, Rajmahal Rd, Michael Sarani, Benachity, Durgapur, West Bengal 713213",
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": null,
        "reviews": "Excellent doctor in homoeopathy - Dr. Raju Das. Good person. His diagnosis and treatment is spot on!; Best doctor"
    },
    "Dr Ashish krishna laparoscopic & GI surgeon": {
        "name": "Dr Ashish krishna laparoscopic & GI surgeon",
        "rating": "4.5",
        "address": "Immon Kalyan, Saptarshi Sarani, Durgapur, West Bengal 713212",
        "phone": "098008 81805",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": "themissionhospital.com",
        "hours": "Sunday, Closed; Monday, 2 to 4 pm; Tuesday, 12 to 5 pm; Wednesday, Closed; Thursday, 12:30 to 5 pm; Friday, 2 to 4 pm; Saturday, 12 to 4 pm. Hide open hours for the week",
        "reviews": "Dr Ashish Krishna sir is really so good doctor not only a good doctor but really so good human being he treat his patients like  his own family member's he is really so humble person . recently he have done surgery of my father and now my …; Dr Ashish Krishna allready very good surgeon but you are very good human being.\nHe is very polite and soft; Dr Ashish did my hernia surgery ,he is a very skilled surgeon but what I like the most about him is that he keeps his cool which makes his confidence even higher .I would highly recommend anyone who has complications to go to him ,he can …; In 2022 sir doing my mother rectal prolapse surgery, at this  time i was consulting many doctors but no one agree to solve my mother's problem but he is only person who help me like a god....many many thanks sir, 🙏🙏 …; Dr. Ashish Krishna sir, is one of the best laproscopic surgeon as well as a very good person. He is very helpful and did my sister's(SWATI PAL) painless surgery last week. She has no complications. He always attains his patient and patient's family members politely. We will always be grateful to him. 🙏🙏 …; Mr Sanjay ghosh speak\nDr ashish Krishna is second god,🙏🙏\nVery good behaviour, …; Dr,Asish Krishna is a very very good doctor who always responses the patients whenever needed.His response,his amiable behaviour just outstanding.He is very busy in his profession but his responsibility to every patient is quite …"
    },
    "Dr. Satyendra Nath Dutta": {
        "name": "Dr. Satyendra Nath Dutta",
        "rating": "4.9",
        "address": "Health world hospitals, Gandhi More, Benachity, Durgapur, West Bengal 713216",
        "phone": "081700 52906",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Sunday, Closed; Monday, 9 am to 5 pm; Tuesday, 9 am to 5 pm; Wednesday, 9 am to 5 pm; Thursday, 9 am to 5 pm; Friday, 9 am to 5 pm; Saturday, 9 am to 5 pm. Hide open hours for the week",
        "reviews": "Really Great Doctor. Very good behaviour with best treatment. I am satisfied. I always recommend my all family members to this Dr.S.N.Dutta sir; Great experience with dr. satyendra nath dutta.. Well behavior and very friendly nature 🙏😊 …; One of the best cardiologist in the town.... We are blessed that you are with us Doctor S N Dutta; Nice doctor well behavior,, polite and give patient time ...sir done my father in law PTCA; Best interventional cardiologist in Durgapur..\nVery decent and polite behavior...\nRecommended for all cardio patients...; I am from Farakka I know dutta sir from last 1 year excellent heart doctor...my uncle his patient; Friendly natural well experienced doctor I have ever seen🙏 …; Exalant Doctor. Friendly beabher. Smooth poresider. Friendly approach. Trouble free prosses.; Dr Satyendranath Dutta is one of the best Interventional cardiologist available in Durgapur."
    },
    "Sanaka Clinic": {
        "name": "Sanaka Clinic",
        "rating": "4.5",
        "address": "Holding No. 14, Bengal Shrishti, BLOCK-A, Kamdhenu, City Center, Durgapur, West Bengal 713216",
        "phone": "097755 55333",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": "sanakaclinic.com",
        "hours": "Sunday, 7 am to 8:30 pm; Monday, 7 am to 8:30 pm; Tuesday, 7 am to 8:30 pm; Wednesday, 7 am to 8:30 pm; Thursday, 7 am to 8:30 pm; Friday, 7 am to 8:30 pm; Saturday, 7 am to 8:30 pm. Hide open hours for the week",
        "reviews": "Best diagnostic clinic durgapur... All reports are done here with  proper way .. All the facilities  are available  here like USG, All types of Blood  test , CT scan,MRI and all types allopathic  and ayurvedic  medicine  available  here  at our Sanaka  Pharmaceutics .; Best diagnostic clinic in Durgapur city centre.; Best diagnostic clinic in Durgapur; Great Doctors, the ambience is also very good. The Experience is hassle free and fast.; Best diagnostic centre and best hospitals in Durgapur; Best Diagnostic clinic in Durgapur.; Best clinic in durgapur city centre.; Best clinic in Durgapur; Good"
    },
    "Dr. Sayani Dolui || Best Gynecologist in Durgapur || Best Gyneo doctor": {
        "name": "Dr. Sayani Dolui || Best Gynecologist in Durgapur || Best Gyneo doctor",
        "rating": "5.0",
        "address": "ESIC SUb Regional Office, City Center, C-49, Mahatma Gandhi Rd, opposite 9, Gandhi More, Commercial Area, Durgapur, West Bengal 713216",
        "phone": "089188 24885",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Sunday, Closed; Monday, 7 am to 8 pm; Tuesday, 7 am to 8 pm; Wednesday, 7 am to 8 pm; Thursday, 7 am to 8 pm; Friday, 7 am to 8 pm; Saturday, 7 to 8 am. Hide open hours for the week",
        "reviews": "Excellent Dr. Best gynecologist in Durgapur.\n\n.      Helpful Dr.😊😊❤️❤️ …; Best doctor; a new ray of hope"
    },
    "Dr P K Bhattacheryay": {
        "name": "Dr P K Bhattacheryay",
        "rating": "5.0",
        "address": "G8JH+73R Opposit to SAHA SWEETS, Gurudwara Road, Benachity, Durgapur, West Bengal 713213",
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": null,
        "reviews": "Very good and well experienced doctor."
    },
    "Dr Hemant Kumar Nayak: Pediatric cardiologist, Durgapur || Child and Adult congenital heart doctor || Fetal Echo specialist.": {
        "name": "Dr Hemant Kumar Nayak: Pediatric cardiologist, Durgapur || Child and Adult congenital heart doctor || Fetal Echo specialist.",
        "rating": "4.9",
        "address": "The Mission Hospital Immon Kalyan Sarani, Sector IIC, Bidhannagar, Durgapur, West Bengal 713212",
        "phone": "098008 81763",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": "drhemantnayak.com",
        "hours": "Sunday, Closed; Monday, 9 am to 5 pm; Tuesday, 9 am to 5 pm; Wednesday, 9 am to 5 pm; Thursday, 9 am to 5 pm; Friday, 9 am to 5 pm; Saturday, Closed. Hide open hours for the week",
        "reviews": "Dr Hemant Kumar Nayak is not only a well experienced doctor but also a well behaved person.Appearing to us like an angel he supports us,encourages us and finally helps us to return home with my little daughter.I have no words to thank him and I will be highly obliged to him till I live this life.; First of all, I would like to give my lot of thanks to Dr. Hemant Kumar Nayek, at 'The Durgapur Mission Hospital\". Before one year ago, I do micro-surgery of my wife, Juli Choudhury for the lasts extreme amount of heart hole by this Doctor. …; We, the family members of Ms. Tirshana Rai would like to acknowledge the wanderful support and guidance we have received from the hospital management Mission Hospital(Durja Pur) Indian. Thank you Dr Hamant Kumar Nayak for your special …; The best doctor I have seen in my life. I have never seen such a good doctor in my life. He is a man free of pride.He is always Tries to understand the patient's words and suffering♥️🌹 …; Dr. Hemant Kumar Nayak is one of best pediatric-cardiologist in India having very charming and magnetic personality. My daughter has been diagnosed with PARTIAL AVSD before birth by fetal echo done by him in 2013. Dr. Nayak and Dr. S. …; Dr. Hemant Kumar Nayak is a great paediatric cardiologist in India. His behaviour is also  very good. He is God to me."
    },
    "Dr Malay Nandi": {
        "name": "Dr Malay Nandi",
        "rating": "4.6",
        "address": "G972+R36, Bidhannagar, Durgapur, West Bengal 713212",
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Sunday, Closed; Monday, 8:30 to 11 am; Tuesday, 8:30 to 11 am; Wednesday, 8:30 to 11 am; Thursday, 8:30 to 11 am; Friday, 8:30 to 11 am; Saturday, 8:30 to 11 am. Hide open hours for the week",
        "reviews": "I had an incredibly disappointing and distressing experience when I took my 3-month-old child for a vaccination appointment with Dr. Nandi yesterday. It was nothing short of a nightmare from start to finish, and I feel compelled to share my …; Mostly emphasis on home remedies along with medicine to cure the disease,always avoid antibiotics dose to children which damages immune system of kids.\nWe are lucky to have a well experienced Doctor like him in our society (Bidhannagar).He is kind hearted &  bottom to Earth person.; Very much experience doctor; Very good doctor; Good doctor; Very good doctor; Good Doctor"
    },
    "Dr Sukanta Das": {
        "name": "Dr Sukanta Das",
        "rating": "5.0",
        "address": "Life Care Hospital, Abanindra Bithi, near Smart Bazar, Doctor's Colony, City Center, Durgapur, West Bengal 713216",
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": "lifecarehospitaldurgapur.com",
        "hours": "Sunday, Closed; Monday, 5:30 to 8:30 pm; Tuesday, 5:30 to 8 pm; Wednesday, 6 to 8 pm; Thursday, 6:30 to 8:30 pm; Friday, 6 to 8:30 pm; Saturday, 6 to 8:30 pm. Hide open hours for the week",
        "reviews": "Best Neurosurgeon in Durgapur"
    },
    "Dr. Satyajit Bose": {
        "name": "Dr. Satyajit Bose",
        "rating": "4.4",
        "address": "B 145, Columbia St, Sector-2B, Bidhannagar, Durgapur, West Bengal 713212",
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": null,
        "reviews": "This cardiac surgeon, like many others in West Bengal and all over India, has made it a business practice to frighten prospective patients and their families into doing heart bypass surgery even when it is not required. He did this with my …; Dr. Bose is an exceptional doctor who is knowledgeable and compassionate.I highly recommend Dr. Bose for expertise and caring nature. He takes the time to listen and explain things thoroughly, making feel valued as a patient.\nI appreciate professionalism and the genuine concern they show for their patients.; Dr.Satyajit Bose is one of the greatest surgeon I have ever known. Also,\nThe mission hospital provides great hospitality. I was totally satisfied.; Dr. Satyajit is one of the greatest cardiac surgeons I have ever seen. His expertise in crucial cardiac cases is commendable.; Yesterday I visited  09.05.2024 Mission Hospital and meet Dr Satyajit Bose  but I am not satisfied.  Behavior too good; A class surgeon in West Bengal. My experience is very good at The Mission Hospital, Durgapur.; Good experience with Mission hospital and Dr Satyjit Bose sir; Dr. Satyajit Bose is one of the great cardiac surgeon"
    },
    "Dr Manidipa Majumdar (MD, DM cardiology)": {
        "name": "Dr Manidipa Majumdar (MD, DM cardiology)",
        "rating": "5.0",
        "address": "Gouri Devi Medical College and Hospital, City Center, Rajbandh, Durgapur, West Bengal 713212",
        "phone": "098302 60823",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Sunday, Closed; Monday, 9 am to 6 pm; Tuesday, 9 am to 6 pm; Wednesday, 9 am to 6 pm; Thursday, 9 am to 6 pm; Friday, 9 am to 6 pm; Saturday, 9 am to 6 pm. Hide open hours for the week",
        "reviews": "Mam first of all I don't know how to plaudit to you. I will not afflict to you by saying thank you. Because I found you as a cherub. I was not able to taking any decisions for my father, because many doctors are here , telling us deferent …; You  are a very  good  doctor. your  behavior  is very  good. My Husband is very  well  now due to  your treatment. i am speechless.😊. Thank you ma'am🙏🙏❤️❤️ …; Very good doctor in my openion. One of the best doctor in the department of Cardiology. I am very happy with your behaviour as a doctor, not only doctor but also a good human being a good mentor. Wish you a happy journey mam.; Manidipa Majumdar ma'am you are a great doctor. Because of you my father got a new life me and my whole family are thankful to you. You are not only a great doctor but also a good human being.; Her behaviour is very very good 💓 i really respect her  as a doctor …; You  are a very  good  doctor. your  behavior  is very  good. My mother is very  well  now due to  your treatment. i am speechless.😊 …; As a DR. Very good , Friendly and so honesty .; You are a great doctor mam 🤩 …"
    },
    "Dr. Biswajit Banik": {
        "name": "Dr. Biswajit Banik",
        "rating": "5.0",
        "address": "G88X+4JX, SSB SARANI, Bidhannagar, Durgapur, West Bengal 713212",
        "phone": "081700 52888",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Sunday, Closed; Monday, 5 to 7 pm; Tuesday, 5 to 7 pm; Wednesday, 5 to 7 pm; Thursday, 5 to 7 pm; Friday, 5 to 7 pm; Saturday, 5:30 to 6:30 am. Hide open hours for the week",
        "reviews": "The location of the facility is wonderful. It is hardly twenty foot steps away from the Pump House bus stop on the 8B bus route. This outreach facility of The Healthworld Hospital houses several OPD clinics and pathological sample collection booths.; Very good dr & behaviour is to good"
    },
    "Dr Jiwesh kumar thakur": {
        "name": "Dr Jiwesh kumar thakur",
        "rating": "5.0",
        "address": "Dreamland hospital,esby more ,s s b sarani, 01, Durgapur, West Bengal 713201",
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Sunday, Open 24 hours; Monday, Open 24 hours; Tuesday, Open 24 hours; Wednesday, Open 24 hours; Thursday, Open 24 hours; Friday, Open 24 hours; Saturday, Open 24 hours. Hide open hours for the week",
        "reviews": ""
    },
    "Dr. Anupam Bardhan": {
        "name": "Dr. Anupam Bardhan",
        "rating": "5.0",
        "address": "H763+VGQ, Main Gate, Durgapur, West Bengal 713203",
        "phone": "094757 43346",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": null,
        "reviews": "Arguably the best Homoeopathy doctor in the city."
    },
    "Dr.Tapan Kumar Matia": {
        "name": "Dr.Tapan Kumar Matia",
        "rating": "4.5",
        "address": "Immon Kalyan, 219 (P, Saptarshi Sarani, Sector-2C, Bidhannagar, Durgapur, West Bengal 713212",
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": null,
        "reviews": ""
    },
    "Dr Surajit Gorai MD (Gold Medal) Dermatologist": {
        "name": "Dr Surajit Gorai MD (Gold Medal) Dermatologist",
        "rating": "4.7",
        "address": "Shop no B14, Kalyani Medical Stores, Hudco More, Aranyak (West), Bidhannagar, Durgapur, West Bengal 713212",
        "phone": "091238 56730",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": "drsgorai.com",
        "hours": "Sunday, 9 am to 6 pm; Monday, Closed; Tuesday, Closed; Wednesday, Closed; Thursday, Closed; Friday, Closed; Saturday, Closed. Hide open hours for the week",
        "reviews": "Very good doctor in durgapur; These kind of doctor required from very beginning in durgapur; Excellent doctor; Good doctor; Excellent; Satisfied; Excel diagnosis"
    },
    "Dr. Anirban Dasgupta": {
        "name": "Dr. Anirban Dasgupta",
        "rating": "4.7",
        "address": "near Mohananda Cancer Hospital, Bidhannagar, Durgapur, West Bengal 713212",
        "phone": "086875 00500",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": "dranirbandasgupta.getmy.clinic",
        "hours": "Sunday, Closed; Monday, 10 am to 5 pm; Tuesday, 10 am to 5 pm; Wednesday, 10 am to 5 pm; Thursday, 10 am to 5 pm; Friday, 10 am to 5 pm; Saturday, 10 am to 5 pm. Hide open hours for the week",
        "reviews": "u told my aunt that she has cancer at she had was tumour . you said she will live for 5 years and what not but now she is completely fine. seriously u are a shame for the whole doctor community. while many of ur colleagues are dedicated to …; Dr. Anirban is a professional who works for his passion. He will make you hopefull in any adverse situation. Always welcoming, he ensures that the patient and the attendees are well aware of the case and all the pros and cons. A highly empathetic doctor, which is very rare to find in today's world.; Dr. Anirban Dasgupta is a gem among medical fertility. He is humble and well behaved human being. My wife's   surgery was done successfully by him 20 days back, After surgery also he is guiding regularly for her speedy recovery. We would …; Dr. Dasgupta is the best doctor ever in my eyes. His behavior, guidance and skill is incomparable.  20 days back I had my c section delivery by him and ever since he is guiding us. …; First of all I along with my sister thanks him for treating our mother and Surgery went successful of Laparotomy Primary Debulking. He is a great admirable human being who understands the patient emotions and sentiments of their family …"
    },
    "Aarogyam Neuroclinic Durgapur": {
        "name": "Aarogyam Neuroclinic Durgapur",
        "rating": "4.5",
        "address": "ORA-1, JL avenue B1 More, Durgapur, West Bengal 713214",
        "phone": "074777 95100",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": "aarogyamneuro.org",
        "hours": "Sunday, 10 am to 6 pm; Monday, 10 am to 8:30 pm; Tuesday, 10 am to 8:30 pm; Wednesday, 10 am to 8:30 pm; Thursday, 10 am to 8:30 pm; Friday, 10 am to 8:30 pm; Saturday, 10 am to 8:30 pm. Hide open hours for the week",
        "reviews": "I have done my treatment with DR PRAVEEN KUMAR YADAV only once so far, I like the doctor very much, he is very polite and humble. But one thing their management could have been better because I didn't see any fast facility for emergency patients, If someone takes emergency patients, they will take time,that's why I gave 4 stars.; I recently visited Aarogyam Neuro Clinic and had a mixed experience. Dr. P kr Yadav demonstrated excellent expertise and professionalism in addressing my concerns, which was certainly a positive aspect of my visit. However, the overall …; Praveen sir is great.\nBut yes staff behavior is like they are the main doctor, even the workers acts like they are the boss, cleanliness and discipline is on top priority. …; Horrible experience. Inhuman approach towards patients. Highly overconfident organisation. I had travelled all the way from Rampurhat (120 KMs) to see Dr. PRAVEEN KR YADAV through prior appointment at 1 pm. Somehow we reached at 10.30 am so …; \"Visiting Aarogyam Neuroclinic was the best decision I made for my health. Dr. Praveen is incredibly knowledgeable and caring. He took the time to explain my condition and treatment options thoroughly.\"\"\"; \"\"\"The care I received at Aarogyam Neuroclinic was top-notch. Dr. Praveen is an exceptional neurologist who truly cares about his patients. The clinic is clean and well-organized.\"\"\""
    },
    "Dr. Indranil Mukherjee ENT and Head Neck Surgeon/ Life Care Hospital/ City centre": {
        "name": "Dr. Indranil Mukherjee ENT and Head Neck Surgeon/ Life Care Hospital/ City centre",
        "rating": "5.0",
        "address": "G7QX+M78 Life Care Hospital, near Big Bazar, City Center, Durgapur, West Bengal 713216",
        "phone": "074777 16138",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Sunday, Closed; Monday, Closed; Tuesday, 9 to 11 am; Wednesday, Closed; Thursday, 9 to 11 am; Friday, Closed; Saturday, 5 to 7 pm. Hide open hours for the week",
        "reviews": "Very good knowledge and experience with well behavior 👏 …"
    },
    "Dr Sutapa Sit": {
        "name": "Dr Sutapa Sit",
        "rating": "4.6",
        "address": "Commercial Area, C-49, opp. ESIC Sub-Regional Office, near Gandhi More, Gandhi More, City Center, Durgapur, West Bengal 713216",
        "phone": "081700 52945",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": "drsutapasitgynae.com",
        "hours": "Sunday, Closed; Monday, 9 am to 12 pm; Tuesday, 9 am to 4 pm; Wednesday, 12 to 2 pm; Thursday, Closed; Friday, Closed; Saturday, 9 am to 4 pm. Hide open hours for the week",
        "reviews": "She is undoubtedly one of the best gynaecologists in Durgapur. My mother had a major surgery under her and now she is completely fit. Ma'am has also been treating my wife for more than 6 months and we are highly satisfied with her treatment procedure..; Very good doctor and supportive"
    },
    "eElementa Ayurveda Treatment in Durgapur": {
        "name": "eElementa Ayurveda Treatment in Durgapur",
        "rating": "5.0(2)",
        "address": "C-2/2, Ground Floor, Central Park, 2nd St, Doctor's Colony, City Center, Durgapur, West Bengal 713216",
        "phone": "085977 45505",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Saturday, 12 to 8:30 am, 9:30 am to 12 am; Sunday, 12 to 8:30 am, 9:30 am to 12 am; Monday, 12 to 8:30 am, 9:30 am to 12 am; Tuesday, 12 to 8:30 am, 9:30 am to 12 am; Wednesday, 12 to 8:30 am, 9:30 am to 12 am; Thursday, 12 to 8:30 am, 9:30 am to 12 am; Friday, 12 to 8:30 am, 9:30 am to 12 am. Hide open hours for the week",
        "reviews": ""
    },
    "Dantyam-DR UTPAL/UPASAK MUKHERJEE BEST DENTIST/DENTAL CLINIC AND ORTHODONTIC CENTRE NEAR ME IN CITY CENTRE DURGAPUR": {
        "name": "Dantyam-DR UTPAL/UPASAK MUKHERJEE BEST DENTIST/DENTAL CLINIC AND ORTHODONTIC CENTRE NEAR ME IN CITY CENTRE DURGAPUR",
        "rating": "4.8",
        "address": "1/6, near Big Bazaar, Doctor's Colony, Central Park, City Center, Durgapur, West Bengal 713216",
        "phone": "099328 39030",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Sunday, 10 am to 6:30 pm; Monday, 10 am to 6:30 pm; Tuesday, 10 am to 6:30 pm; Wednesday, 10 am to 6:30 pm; Thursday, Closed; Friday, 10 am to 6:30 pm; Saturday, 10 am to 6:30 pm. Hide open hours for the week",
        "reviews": "Highly recommended!! I'm currently going through my braces treatment.The behaviour of doctors and staff members were very friendly and professional. They really took the necessary time to do everything right and took some really good time to get to know me and my family. Great dental experience!; So I have experienced something extraordinary in Dantyam clinic . It's the best clinic for dental care as they are well trained and experienced in their work .\nThe doctor is very friendly and he treats people or his patients not just like …; Very good treatment in reasonable cost. Anybody can trust without any hasitation. Helpful and familiar behavior of Doctors. The clinic has all types of facilities. My daughter has taken braces treatment during 2023-24 successfully with an excellent result. We're very satisfied.; I recently completed my braces treatment at Dantyam and I am absolutely thrilled with the results. From start to finish, the entire process was smooth and exceeded my expectations.Dr. Upasak and the staff were incredibly professional, …; So, I recently got my braces treatment done here...\nAnd it was so smooth from first appointment to the last appointment.\nI was told that my braces will take 12 months but within 3 months I was able to …; I recently got  my braces treatment with Dr Upasak Mukherjee and couldn't be happier with the result. From the initial consultation to the final adjustments, the entire process was smooth and professional. …"
    },
    "Dr. Irfan Sahab": {
        "name": "Dr. Irfan Sahab",
        "rating": "5.0",
        "address": "17th, Street, Vivekananda Ave, A-Zone, Durgapur, West Bengal 713204",
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": "facebook.com",
        "hours": null,
        "reviews": "One of the finest doctor of Durgapur, his vision towards every disease is on different. Dr. Uncle not only cure his patients but he also take good care of them. Dr. Uncle is the greatest man ever.; A good doctor with a big heart. He takes time with the patient to cure him/her. I highly recommend him to anyone looking for a specialist.; He is not only Doctor but also a great person.He is specialist of \"Broken heart surgery\" with 30+ years of experience.; Great doctor very much experienced, good man with big heart; How to get a appointment from him . Lot of rush there . Any way to meet him personally ..; Doctor ke roop mein bhagwan....🙏 …; Jai ho; Pravu ki Jai Ho; 🙏🏼🙏🏼🙏🏼 …"
    },
    "Dr. Sudipta Bhattacharjya: Best Pediatric Cardiologist in Durgapur || Best Child Heart Specialist doctor in Durgapur, Burdwan": {
        "name": "Dr. Sudipta Bhattacharjya: Best Pediatric Cardiologist in Durgapur || Best Child Heart Specialist doctor in Durgapur, Burdwan",
        "rating": "5.0",
        "address": "Immon, Kalyan Sarani, Sector IIC, Bidhannagar, Durgapur, West Bengal 713212",
        "phone": "079088 14637",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Sunday, 9 am to 6 pm; Monday, 9 am to 6 pm; Tuesday, 9 am to 6 pm; Wednesday, 9 am to 6 pm; Thursday, 9 am to 6 pm; Friday, 9 am to 6 pm; Saturday, 9 am to 6 pm. Hide open hours for the week",
        "reviews": "Dr . Sudipta Bhattacharjya is a very experienced, polite and a child friendly person."
    },
    "Hahnemann Homeo Clinic": {
        "name": "Hahnemann Homeo Clinic",
        "rating": "4.0",
        "address": "Mining and Allied Machinery Corporation, B1- More, Durgapur, West Bengal 713210",
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": null,
        "reviews": ""
    },
    "Dr Sharmistha Das": {
        "name": "Dr Sharmistha Das",
        "rating": "3.9",
        "address": "5/12, Uday Shankar Bithi, Non-Company Housing Estate, City Center, Durgapur, West Bengal 713216",
        "phone": "098000 24188",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Sunday, 10 am to 12 pm; Monday, 6 to 8 pm; Tuesday, 6 to 8 pm; Wednesday, 6 to 8 pm; Thursday, Closed; Friday, 6 to 8 pm; Saturday, 6 am to 8 pm. Hide open hours for the week",
        "reviews": "All I can say is that she is a life saviour. The most experienced Dermatologist we have in Durgapur. I was facing a serious infection and consulted one of the renowned doctor before. He initially gave me medicines for 3 weeks worth Rs. 2500 …; A well known famous dermatologist in Durgapur very good behaviour take time listen to patients carefully give advice very clearly attendant also breif process clearly …; The Best..\nI had an allergy during his lockdown, I got mam's contact details from google and as I stay far away from Durgapur, at Adra , we would have needed  to arrange …; The doctor is a little bit rude but the lady who sits at the gate is the worst at behaviour. I have seen such a kind of person at doctors' chambers. The doctor must teach her some basics about how to behave with patients.; While it shows that the doctor is available for consultation, found that the doctor wasn't present resulting in problems for patients coming to the location to consult her.; Good dermatologist. Very experienced senior doctor of skin & hair etc. Appointment by physically visit only. No phone booking accepted. This is not the right thing in current time. Usually about 45-60 minutes to wait after registering name. Waiting hall is air conditioned and has chair good seating arrangement."
    },
    "Dr. ABHISHEK MONDAL (Gold Medalist - Chennai) | Best Neurosurgeon in Durgapur .A/W Vivekananda Hospital, Durgapur": {
        "name": "Dr. ABHISHEK MONDAL (Gold Medalist - Chennai) | Best Neurosurgeon in Durgapur .A/W Vivekananda Hospital, Durgapur",
        "rating": "5.0",
        "address": "SAIL Co-operative, Kabiguru, City Center, Durgapur, West Bengal 713216",
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": "durgapurhub.com",
        "hours": null,
        "reviews": "Doctor behaviour so goods my patients treatment by dr Abhishek sir\nI am fully satisfied\nSir clear all communication sir very much helpful\nThankyou so much sir; Dr Abhishek mondal very good neuro surgeon my patient treatment the doctor. Abhishek sir behaviour are so goods very good doctor .his clear communication and though explanation will make you feel confident and at ease the treatment .I am …; We clearly understand the process after consulting with the doctor about the operation  the operation was a great success and we are really very satisfied with the status of the patient a great warm Thank you to the Doctor.; Dr. Abhishek is an outstanding neurosurgeon who combines exceptional medical expertise with genuine compassion. His clear communication and thorough explanations will make you feel confident and at ease throughout the treatment. Highly recommend for anyone seeking top-notch neurosurgical care!; Im very impressed  the doctor behavior  his clear communication  will make you feel confident  and at ease throughout the treatment. Full satisfied  treatment the doctor. Thanks a lots; Have shown to Dr. Abhishek Mondal in OPD. Good treatment provide. Iam satisfied for OPD treatment.; Sir did a great job and he also explains that the patient will recover in 6 days and  the patient will recover I'm really impressed and very satisfied. Thank you so much sir.; My patient name is chandana saha.. I admitted under the Dr Abhishek mondal sir..\nMy patient diagnosis _ post L3, L4 Laminectomy with L3_L4/L4,L5 Discectomy.. …"
    },
    "Dr. Rupam Sinha (Danta Suraksha Clinic) - Dental Surgeon in Durgapur": {
        "name": "Dr. Rupam Sinha (Danta Suraksha Clinic) - Dental Surgeon in Durgapur",
        "rating": "4.4",
        "address": "Central Park, 4/8, 4th Street, Doctor's Colony, City Center, Durgapur, West Bengal 713216",
        "phone": "093318 94508",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Sunday, 11 am to 7 pm; Monday, 11 am to 7 pm; Tuesday, 11 am to 7 pm; Wednesday, 11 am to 7 pm; Thursday, Closed; Friday, Closed; Saturday, 11 am to 7 pm. Hide open hours for the week",
        "reviews": "Wouldn't recommend at all. Mother had 2 RCTs done both the RCT both got infected. Complained about my tooth didn't fix my tooth instead did filling in other teeth and the tooth got infected beyond recovery.; Doubt whether he knows to do RCT or not. Mine was damaged by him to such extent that I had to take IV/ subcutaneous painkillers injections to reduce pain after visiting him five …; Worst dentist behaviour wise. I took my 4 years old daughter as she had tooth ache, she went to a dentist for the first time in her life. She started crying seeing the equipments then the dentist started scolding very rudely and did his job. He doesnot know speaking politely. Should learn. Scolding is not the solution.; Best doctor I have ever meet. Specialist in dental and any oral problem. His timely detection and advice really helped us. Best clinic with good infrastructure.; I met with him several time due to my mother  treatment. My mother  is suffering with Trigeminal Neuralgia from a long time. By his wonderful  treatment  my mother  is completely stable right now. I proud  for his humanity and good behavior  with the patients.; best treatment by the doctor...chamber is very clean and 5 star quality; Dr Rupam Sinha is an excellent Doctor. As dentists work in a very small and sensitive space of the body, a good dentist communicates with the patients during every step of a procedure, making sure they are okay and not in too much pain. Dr …"
    },
    "Dr D Saha, MBBS,DPM,MD, DCMH( NIMHANS, BANGALORE) || NEURO PSYCHIATRIST & SEXOLOGIST": {
        "name": "Dr D Saha, MBBS,DPM,MD, DCMH( NIMHANS, BANGALORE) || NEURO PSYCHIATRIST & SEXOLOGIST",
        "rating": "5.0",
        "address": "TN School Road, Station Rd, Station Bazar, Industrial Area, Durgapur, West Bengal 713201",
        "phone": "086700 98240",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Sunday, 8 am to 3 pm; Monday, 8 am to 1:30 pm; Tuesday, 8 to 10 am; Wednesday, Closed; Thursday, Closed; Friday, Closed; Saturday, Closed. Hide open hours for the week",
        "reviews": "He is Best Doctor . He prescribe least medicines. Under his care i recover very fast; One of the best neuro-psychiatrist doctor in asansol.; Best neuro psychiatrist Dr in durgapur. Sir treatment is very good; Good neuro-psychiatrist doctor and overall behavior is good; He is renowned de addiction specialist in Asansol; In my own experience, sir D Saha is the best doctor; Very kind personality & bhevior and best treatment ever; Very sincere and friendly behaviour with excellent knowledge.; Best doctor I have met ever"
    },
    "Dr. Samujjala Deb Chatterjee - Best Dermatologist in Durgapur | Skin problems, Hair loss, Pigmentation treatment": {
        "name": "Dr. Samujjala Deb Chatterjee - Best Dermatologist in Durgapur | Skin problems, Hair loss, Pigmentation treatment",
        "rating": "4.6",
        "address": "S.S, A-66, More, Bidhannagar, Durgapur, West Bengal 713212",
        "phone": "080017 86904",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": "youtube.com",
        "hours": "Sunday, 12:30 to 7:30 pm; Monday, Closed; Tuesday, Closed; Wednesday, Closed; Thursday, Closed; Friday, 12:30 to 7:30 pm; Saturday, 12:30 to 7:30 pm. Hide open hours for the week",
        "reviews": "I went in for a consultation with Dr samujjala for a scar I had from a procedure done last year-She listened to my concerns and recommended that I start with micro-needling to diminish the appearance of the scarring. - I am so glad that I …; Ma'am first of all you thank you 🙏\nMai apne face se bhut presan thi pimples, acne se\nOr abhi aap k pass jab se mai gayi mere face bilkul thik ho gya …; Samujjala mam is just too good.... My experience has been wonderful so far. She will provide you with the best and latest skin treatment applicable to your skin. I follow her on YouTube and insta as well where she provides some valuable advices and feedback.; Dr was very warm and friendly and made me comfortable to ask questions about my skin health.; Bad experience, all are paid review I had a acne problem but my treatment was not successful, worst of money; Very experienced doc. I have gone two times for different issues and both are completely cure by short time. Very much satisfied 🙂 thank you mam🌻 …; At first treatments is very poor. I have skin problem and I invest almost 13 to 14 thousand and net result was zero, very very poor service. No time table. But behaviour is good"
    },
    "Dr. Azizur Rahman's home and clinic": {
        "name": "Dr. Azizur Rahman's home and clinic",
        "rating": "5.0",
        "address": "G8Q2+C87, Sambhu Mitra Path, Doctor's Colony, City Center, Durgapur, West Bengal 713216",
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": null,
        "reviews": "The best pediatrician in durgapur. His experience is vast. He doesn't prescribed medicine unnecessary. takes time and listen to the parents. Explains everything carefully."
    },
    "Dr Anil Sarkar": {
        "name": "Dr Anil Sarkar",
        "rating": "3.9(35)",
        "address": "H74J+HWP, Ramkrishna Pally, Michael Sarani, Benachity, Durgapur, West Bengal 713213",
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": null,
        "reviews": ""
    },
    "Care & Cure": {
        "name": "Care & Cure",
        "rating": "3.8",
        "address": "Dr.P. K. Sarkar.Care&Cure, 209, Sarath Chandra Ave, B-Zone, Durgapur, West Bengal 713205",
        "phone": "094340 02692",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": null,
        "reviews": "I am under treatment of Dr. P. K. Sarkar for skin ailments and gastric complaints. I have been highly benefited by his treatment. His clinic is clean and tidy. He is easily available at times of emergency.; Very bad treatment,  I am really disappointed from the treatment,  very high fees, I think all over west bengal most expensive homeopathy doctor about the fees, but about the treatment,  nothing,  don't waste of money and time ,; The name of the clinic is very much justified. Care and cure both are genuinely taken care of.; Worst doctor ever. He is slower than tortoil. Do not waste your time by visiting there.; It hospitality is good with better treatment.; Very good success rate!; Experience and good doctor."
    },
    "Dr. Sougato Kumar Sarkar - Best Gynaecologist in Durgapur, Dr Sougato Kumar Sarkar- Top Gynaecologist in Durgapur": {
        "name": "Dr. Sougato Kumar Sarkar - Best Gynaecologist in Durgapur, Dr Sougato Kumar Sarkar- Top Gynaecologist in Durgapur",
        "rating": "4.9",
        "address": "Queen's Clinic, Steel Park, Bidhannagar, Durgapur, West Bengal 713206",
        "phone": "075858 88583",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Sunday, 9 am to 5 pm; Monday, 9 am to 5 pm; Tuesday, 9 am to 5 pm; Wednesday, 9 am to 1:30 pm; Thursday, 9 am to 5 pm; Friday, 9 am to 5 pm; Saturday, 9 am to 5 pm. Hide open hours for the week",
        "reviews": "Dr.Sougata Kumar Sarkar is not only an excellent doctor , he is simple, superb human being ,sober, friendly  caring and intelligent doctor with human values. His treatment method and patient counseling skills are amazing.. I have …; Dr. Sougata  Kumar sarkar is an excellent doctor . Sir's behaviour is very nice and friendly.his treatment method are awesome. I have experience a peaceful pregnancy journey with sir .\nThank you so much sir .; To,\nDr Sougato Kumar Sarkar …; He is the best doctor I ever seen in my life. Thank you so much Dr sougato kr. Sarkar.; Sir's behaviour is very nice and his treatment and his operation hand is awesome.... I feel blessed for you sir that you operate my Cesar and I get my princess so safely.... I am now fit and healthy within 7 days.... Thank you soo much Sir ☺️☺️; Such a beautiful atmosphere. And mostly, god gifted doctor. Thank you sir for your kind behaviour and support; I feel so grateful  that I take my treatment  from sir. Sir done my surgery  and within 7 day I feel very healthy  and fit. Sir's behavior  is good and friendly . I am very thankful to sir🙏🙏 …"
    },
    "Cardiologist Dr Tapan K Matia": {
        "name": "Cardiologist Dr Tapan K Matia",
        "rating": "3.8",
        "address": "G88V+QJ9, Aranyak (West), Bidhannagar, Durgapur, West Bengal 713212",
        "phone": "070987 15367",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": null,
        "reviews": "I am very much greatful to Dr Matia, he virtually gave a second life to my wife, she had heart failure, her heart power was very low - severe LV dysfunction, along with diabetes & high BP not expected to live beyond few days. With only …; My mother had heart problems too.  I took him from Malda to Durgapur without delay and showed him to DR TAPAN KR MATIYA.  He saw my mother's condition and did EMARGENCY ADDMISSION. THE MISSION HASPITAL \"DURGAPUR\". …; very good cardiologist, he did angioplasty on my father during covid times, very helpfull & nice person; Mera father ka Pacemaker sir kiye hain, bohut achhe Hain...; Worst doctor,never go. Only care about money.; Very helpful nature and supportive doctor.; Very very bad doctor. very bad behaviour."
    },
    "Rheumatologist in Durgapur, Dr Abhra Chowdhury": {
        "name": "Rheumatologist in Durgapur, Dr Abhra Chowdhury",
        "rating": "3.8",
        "address": "B1 More Beside Fuljhore carmel school Subheccha Diagnostic, Durgapur, West Bengal 713206",
        "phone": "089183 20361",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": "drabhrachowdhury.com",
        "hours": null,
        "reviews": "Can you please tell the current location of Dr. Abhra where he comes to check the patients in Durgapur ?? Because he doesnot come in Suveccha Diagonstic anymore. I used to be his patient in Suri Birbhum but due to COVID period he doesnot come here anymore. Please HELP.; I visited Dr. Abhra Chandra Chowdhury (M.B.B.S, DNB Medicine EME Vellore, DM Rheumatology) as my father is a patient of Rheumatoid arthritis .  The behaviour of the doctor is very good and friendly in nature and took patience to observe …; Very good; One of the DM reumatology in Durgapur; Very bad experience; Not good"
    },
    "Dr. Arup Ratan Bose- General Physician in Durgapur": {
        "name": "Dr. Arup Ratan Bose- General Physician in Durgapur",
        "rating": "3.0",
        "address": "City Clinic Dr. K K Bose, Benachity, Durgapur, West Bengal 713213",
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": "drarupratanbose.getmy.clinic",
        "hours": "Sunday, Closed; Monday, 9 am to 1 pm, 5 to 8 pm; Tuesday, 9 am to 1 pm, 5 to 8 pm; Wednesday, 9 am to 1 pm, 5 to 8 pm; Thursday, 9 am to 1 pm, 5 to 8 pm; Friday, 9 am to 1 pm, 5 to 8 pm; Saturday, 9 am to 1 pm, 5 to 8 pm. Hide open hours for the week",
        "reviews": "Prolific practitioner, beautiful interaction and behavior; Very good 👍 …"
    },
    "Dr. Shantanu Kumar Das": {
        "name": "Dr. Shantanu Kumar Das",
        "rating": "3.3",
        "address": "219 Immon Kalyan, Bhimpalashri Sarani, Sector 2c, Bidhannagar, Durgapur, West Bengal 713212",
        "phone": "098008 81682",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Sunday, Closed; Monday, 1 to 5 pm; Tuesday, 4 to 5 pm; Wednesday, 1 to 5 pm; Thursday, 4 to 6 pm; Friday, 1 to 5 pm; Saturday, Closed. Hide open hours for the week",
        "reviews": "Very bad doctor. I have consulted to that doctor. He prescribed me the wrong medicine. I started consuming the medicine. When I did not get any result. I have consulted another doctor in narayana hospital, Bengaluru. The doctor of narayana …; Shanatankumar video Ashish Nandan khesari Lal Yadav Bhojpuri; Good doctor but behaviour is not good"
    },
    "Nirmala homeo clinic": {
        "name": "Nirmala homeo clinic",
        "rating": "3.0",
        "address": "2A/12 A K, Nandalal Bithi, Non-Company Housing Estate, City Center, Durgapur, West Bengal 713216",
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Sunday, 10 am to 1:30 pm; Monday, Closed; Tuesday, Closed; Wednesday, Closed; Thursday, Closed; Friday, Closed; Saturday, Closed. Hide open hours for the week",
        "reviews": ""
    },
    "Dr. Manoj Kumar Sudrania | MBBS, MS, MCh (UROLOGY), FRCS (Part 1), FAGE.": {
        "name": "Dr. Manoj Kumar Sudrania | MBBS, MS, MCh (UROLOGY), FRCS (Part 1), FAGE.",
        "rating": "4.7",
        "address": null,
        "phone": "073638 68524",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Sunday, 9 am to 7 pm; Monday, 9 am to 3 pm, 5 to 7 pm; Tuesday, 9 am to 5 pm; Wednesday, 9 am to 5 pm; Thursday, 9 am to 5 pm; Friday, 5 to 8 pm; Saturday, 9 am to 12 pm. Hide open hours for the week",
        "reviews": "He is the perfect person or Dr for urology operation in west bengal.My father is one of the patient of him he succeeded all the surgeries he had to be my father and gave every updates and best in surgery. Our best wishes for your career.And thank you for your support.; He is a very good doctor, great responsible ,manners and behaviour is very good, without any hesitation anybody can go to Dr Manoj Kumar sudrania ,I have been satisfied to see him about the bleeding of prostate operation which was done at …; We did visit him for the treatment of my mother. His behaviour was really nice and you feel assured and in safe hands.; One of the best doctor in Durgapur; Hands down the Best Urologist Doctor in Asansol, Down to earth and well behaviour listens to patients and gives least & effective medicines; Among the best urologist in our city but quite busy……; Best urology doctor in West Bengal. Those People who going to Chennai I will recommend Manoj Sir for best treatment.; Nice doctor and he is very helpful and polite."
    },
    "DR. REKHA CHAUDHURI": {
        "name": "DR. REKHA CHAUDHURI",
        "rating": "4.5",
        "address": "RA57, Gordon Street, Bidhannagar, Durgapur, West Bengal 713212",
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Sunday, 11:30 am to 12:30 pm; Monday, 11:30 am to 12:30 pm; Tuesday, 11:30 am to 12:30 pm; Wednesday, 11:30 am to 2:30 pm; Thursday, 11:30 am to 12:30 pm; Friday, 11:30 am to 12:30 pm; Saturday, 11:30 am to 12:30 pm. Hide open hours for the week",
        "reviews": "Very good dr. And very helpful and all time supporting mam....; Very good Doctor.; Too good,provide s,full time to patients ,caring us; One of the whrot doctor"
    },
    "Byadhi Bidhan Ayurveda clinic": {
        "name": "Byadhi Bidhan Ayurveda clinic",
        "rating": "4.8",
        "address": "Kaviguru Vegetable Market, 9, Kumud Ranjan Mallick Path, Durgapur, West Bengal 713216",
        "phone": "089063 07190",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": "byadhibidhanayurveda.com",
        "hours": null,
        "reviews": "I have a very good experience\nwhile treating for my disease.I am very satisfied by the treatment given by Dr Sarkar.Thank u sir.; I am Tapati Bhattacharya seth. I was suffering from acute knee pain. I am under treatment of Dr B. C. Sarkar. Now I have no pain. I also take the panchakarma and was a great experience. I feel good. Now I am quite fit. Thanks a lot to Dr. B. C. Sarkar.; I am very happy to say that my wife was suffering from migraine since 10yrs .Then l came to know Dr B.C.Sirkar ayurvedic doctor from Byadhi Bidhan and visit his chamber for treatment. After 1yr in his treatment now she is completely cured. …; My mother has been greatly benefitted from Dr. B.C. Sarkar's treatment. My mother was suffering from osteoarthritis from a lot of time and could not walk peoperly. Now, my mother's Arthritis is almost cured and she's able to do her day to day activities smoothly without much pain.; I am suffering from eczema and sleep problem since 5-6yrs, I treated here by Dr. B. C. Sarkar, Now it cured. Also I take panchkarma therapy one time, very good experience, every facilitys are available here. Good environment.; I am suffering  from epilepsy since 2002 but it is not solved  by many doctors  but since 3 yrs I am treated  from Dr.  B. C. Sarkar and now I am very  good condition. Thank your sir. Now my whole  family  treated  under  doctors sarka for any issues.; Hi\nMy name is R P Singh (Civil Engineer) fell on site resulted in slip disc (L-4-5). Went to top orthopaedic doctors of Kolkata. They suggested me in one voice to …"
    },
    "Dr Sankha Koley, Durgapur": {
        "name": "Dr Sankha Koley, Durgapur",
        "rating": "5.0",
        "address": "Sadhana Medical Hall Durgapu Market, Station Road Suri Khana Road, Durgapur, West Bengal 713201",
        "phone": "095479 35679",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Sunday, 6:30 to 8:30 pm; Monday, Closed; Tuesday, Closed; Wednesday, Closed; Thursday, Closed; Friday, Closed; Saturday, Closed. Hide open hours for the week",
        "reviews": "Very nice doctor"
    },
    "Uroheal( Dr Piyush Agarwal ) - a super speciality Kidney & Urology clinic": {
        "name": "Uroheal( Dr Piyush Agarwal ) - a super speciality Kidney & Urology clinic",
        "rating": "4.3",
        "address": "Meghmallar Sarani, Bidhannagar, Durgapur, West Bengal 713212",
        "phone": "099078 90932",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Sunday, 9 am to 5 pm; Monday, 9 am to 5 pm; Tuesday, 9 am to 5 pm; Wednesday, 9 am to 5 pm; Thursday, 9 am to 5 pm; Friday, 9 am to 5 pm; Saturday, 9 am to 5 pm. Hide open hours for the week",
        "reviews": "laser stone surgery. Good service. Thank you dr; Pathetic experience, pathetic staff totally unhelpful and waste of money and time; dr.piyush he is very good and intelligent and helpful parson,he is really very good doctor; Very Bad Experience. I Will not recommend anyone.; One of the finest Uro doctor. He treated my uncle very well with nominal fees. He is feeling far better now. Thank you doctor.; Good behaviour and good care....; Best uro surgeon! Very polite well experienced!!\nThanks dr Piyush!; Very bad; Laser stone surgery available"
    },
    "Skin Laser Center": {
        "name": "Skin Laser Center",
        "rating": "2.3",
        "address": "G8W2+74W, Non-Company Housing Estate, City Center, Durgapur, West Bengal 713216",
        "phone": "083718 91145",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": null,
        "reviews": "So much Expensive for me.; Excellent"
    },
    "Dr Nishant Kumar": {
        "name": "Dr Nishant Kumar",
        "rating": "4.3",
        "address": "119p, Iman Kalyan Sarani, near SBI ATM, Sector IIC, Bidhannagar, Durgapur, West Bengal 713212",
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Sunday, Closed; Monday, 11 am to 6 pm; Tuesday, 11 am to 6 pm; Wednesday, 11 am to 6 pm; Thursday, 11 am to 6 pm; Friday, 11 am to 6 pm; Saturday, 11 am to 6 pm. Hide open hours for the week",
        "reviews": "Good behaviour & good experience dr. & also he is very caring..; caring,good treatment..must visit"
    },
    "Doctor Indranil Mukherjee ENT/ Ghosh Medical/Durgapur Station": {
        "name": "Doctor Indranil Mukherjee ENT/ Ghosh Medical/Durgapur Station",
        "rating": "5.0",
        "address": "Ghosh Medical, Dr Bidhan Chandra Roy Avenue, opposite Durgapur Station Road, Durgapur, West Bengal 713201",
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Sunday, 9:30 to 11:30 am; Monday, Closed; Tuesday, Closed; Wednesday, Closed; Thursday, 5:30 to 7 pm; Friday, Closed; Saturday, Closed. Hide open hours for the week",
        "reviews": "Excellent doctor; Excellent doctor with wide knowledge and experience; Very Good Experience Doctor; Undoubtedly he is a very good doctor.; Totally great experience and full satisfaction is guaranteed.; Very good Doctor"
    },
    "Dr Debasis Biswas": {
        "name": "Dr Debasis Biswas",
        "rating": "2.6",
        "address": "Commercial Area, C-49, opp. ESIC Sub-Regional Office, near Gandhi More, Bengal Ambuja Housing Complex, City Center, Durgapur, West Bengal 713216",
        "phone": "081700 52836",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": "drdebasisbiswasortho.com",
        "hours": null,
        "reviews": "Please don't go to this doctor for any kind of orthostatic treatment,  he is looking in Google for treatment; Medicine knowledge is zero; Make no mistake. No experience, Dr. Debasis Biswas\nLife will bless you."
    },
    "Dr. Kanishka Sarkar - Best Cancer Doctor in Durgapur | Top Oncologist in Durgapur": {
        "name": "Dr. Kanishka Sarkar - Best Cancer Doctor in Durgapur | Top Oncologist in Durgapur",
        "rating": "5.0",
        "address": "Rangamati Path, Bidhannagar, Durgapur, West Bengal 713212",
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Sunday, Closed; Monday, Closed; Tuesday, Closed; Wednesday, 11 am to 5 am; Thursday, 11 am to 5 am; Friday, 11 am to 2 am; Saturday, Closed. Hide open hours for the week",
        "reviews": ""
    },
    "DISHA DIAGNOSTIC CENTER": {
        "name": "DISHA DIAGNOSTIC CENTER",
        "rating": "5.0",
        "address": "bazar, 06, ghosh para, Mamra, Durgapur, West Bengal 713206",
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Sunday, 7 am to 12 pm; Monday, 7 am to 7 pm; Tuesday, 7 am to 7 pm; Wednesday, 7 am to 7 pm; Thursday, 7 am to 7 pm; Friday, 7 am to 7 pm; Saturday, 7 am to 7 pm. Hide open hours for the week",
        "reviews": "Very good... Recommended; Nice experience"
    },
    "Dr B R Datta": {
        "name": "Dr B R Datta",
        "rating": "3.9",
        "address": "Sasankapally, Sagarbhanga, J P Avenue Durgapur, PIN: 713211, Durgapur, West Bengal 713211",
        "phone": "093320 30900",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Sunday, 8 am to 12 pm; Monday, 8 am to 12 pm; Tuesday, Closed; Wednesday, 8 am to 12 pm; Thursday, 8 am to 12 pm; Friday, 8 am to 12 pm; Saturday, 8 am to 12 pm. Hide open hours for the week",
        "reviews": "Experienced gynecologist with good behaviour and politeness to the patients. This is doctor's own house and the chamber is at the ground floor. The chamber opens at 08:00 hour and the visiting fee is 400 INR. Chamber is closed on Tuesdays …; Dr is very experienced and very good doctor. But his chamber doesn't hove sufficient seats for patients .. that's need to be improved; Very very good doctor....nd behaviour is so nice; Fraud hai normal case ko bhi cesar kar tha h; He is an excellent doctor; He is my grandfather......❤️❤️❤️ and he is very polite and friendly.; Nearby well known gynecological Clinic.\nBy Dr.B.R.Dutta; I am not satisfied with this doctor."
    },
    "Modern Physiotherapy Clinic": {
        "name": "Modern Physiotherapy Clinic",
        "rating": "5.0",
        "address": "SAIL Co-operative, City Center, Durgapur, West Bengal 713216",
        "phone": "098321 62375",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": "Sunday, 8:30 am to 2 pm, 5 to 9:30 pm; Monday, 8:30 am to 2 pm, 5 to 9:30 pm; Tuesday, 8:30 am to 2 pm, 5 to 9:30 pm; Wednesday, 8:30 am to 2 pm, 5 to 9:30 pm; Thursday, 8:30 am to 2 pm, 5 to 9:30 pm; Friday, 8:30 am to 2 pm, 5 to 9:30 pm; Saturday, 5 to 9:30 pm. Hide open hours for the week",
        "reviews": "The Doctor is very good. Clinic is very clean. There are magazines for entertainment. Many problems are cured by the doctor - Mr Suvajit Das; Very good doctor. Many machines available.; Very good doctor... Very cooperative and helpful...; Very good behaviour"
    },
    "Dr.Indranil Mukherjee ENT Surgeon/ Vivekananda Hospital": {
        "name": "Dr.Indranil Mukherjee ENT Surgeon/ Vivekananda Hospital",
        "rating": "4.0",
        "address": "Vivekananda Hospital, Bidhannagar, Durgapur, West Bengal 713206",
        "phone": "080010 24444",
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": "facebook.com",
        "hours": "Sunday, Closed; Monday, 3 to 5 pm; Tuesday, Closed; Wednesday, 3 to 5 pm; Thursday, Closed; Friday, Closed; Saturday, 3 to 5 pm. Hide open hours for the week",
        "reviews": "Wounderful experience with Maya ent head and neck centre. Dr. Indranil mukherjee was a wonderful surgeon, and the staff was always helpful and kind.; Very good doctor.."
    },
    "Doctor": {
        "name": "Doctor",
        "rating": null,
        "address": "I Block, near tarak cycle, Nuttan Pally, Benachity, Durgapur, West Bengal 713213",
        "phone": null,
        "link": "https://www.google.com/maps/place/Samiran/data=!4m7!3m6!1s0x39f771007984203b:0x6bf92839b475a24c!8m2!3d23.5204443!4d87.3119227!16s%2Fg%2F11vy0vx892!19sChIJOyCEeQBx9zkRTKJ1tDko-Ws?authuser=0&hl=en&rclk=1",
        "website": null,
        "hours": null,
        "reviews": ""
    }
}